
&ИзменениеИКонтроль("СоздатьВидЦенКонтрагента")
Функция Пр_СоздатьВидЦенКонтрагента(Контрагент, ВалютаРасчетов)
		
	Если НЕ ЗначениеЗаполнено(Контрагент)
		ИЛИ НЕ ЗначениеЗаполнено(ВалютаРасчетов) Тогда

		Возврат Неопределено;

	КонецЕсли;
	
	#Удаление
	СтруктураЗаполнения = Новый Структура("Наименование, Владелец, ВалютаЦены, ЦенаВключаетНДС, Комментарий", 
	Лев("Цены для " + Контрагент.Наименование, 50),
	Контрагент,
	ВалютаРасчетов,
	Истина,
	"Регистрирует входящие цены. Создан автоматически."); 
	#КонецУдаления             
	#Вставка
	Если ТипЗнч(Контрагент) = Тип("Структура") Тогда
		СтруктураЗаполнения = Новый Структура("Наименование, Владелец, Пр_Проект, ВалютаЦены, ЦенаВключаетНДС, Комментарий", 
		Лев("Цены для проекта " + Контрагент.Проект, 50),
		Контрагент.Контрагент,
		Контрагент.Проект,
		ВалютаРасчетов,
		Истина,
		"Регистрирует входящие цены. Создан автоматически."); 
	Иначе
		СтруктураЗаполнения = Новый Структура("Наименование, Владелец, ВалютаЦены, ЦенаВключаетНДС, Комментарий", 
		Лев("Цены для " + Контрагент.Наименование, 50),
		Контрагент,
		ВалютаРасчетов,
		Истина,
		"Регистрирует входящие цены. Создан автоматически."); 
	КонецЕсли;
    #КонецВставки   
	
	НовыйВидЦенКонтрагентов = Справочники.ВидыЦенКонтрагентов.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйВидЦенКонтрагентов, СтруктураЗаполнения);

	ЦенообразованиеФормулыСервер.СформироватьНовыйИдентификаторВидаЦен(НовыйВидЦенКонтрагентов.ИдентификаторФормул, НовыйВидЦенКонтрагентов.Наименование);

	НовыйВидЦенКонтрагентов.Записать();

	Возврат НовыйВидЦенКонтрагентов.Ссылка;

КонецФункции
