#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Пр_ДействующееРаспределение.Записывать = Истина;
	Движения.Пр_ДействующееРаспределение.Очистить();
	Движения.Пр_ДействующееРаспределение.Записать();
	
	Для Каждого СтрокаПроект Из Проекты Цикл
		
		Движение = Движения.Пр_ДействующееРаспределение.Добавить();
		Движение.Период = Дата;
		Движение.Проект = СтрокаПроект.Проект;
		Движение.Расход = Расход; 
		
	КонецЦикла;
	
	Движения.Пр_ДействующееРаспределение.Записывать = Истина;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Если Автор <> ТекущийПользователь Тогда
		Автор = ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли