#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Колонка.ТолькоПросмотр = ?(ЗначениеЗаполнено(Запись.Календарь), Ложь, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура КалендарьПриИзменении(Элемент)
	
	Элементы.Колонка.ТолькоПросмотр = ?(ЗначениеЗаполнено(Запись.Календарь), Ложь, Истина);
	УстановитьСЗКолонка();
	
КонецПроцедуры      

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСЗКолонка()
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗКолонок = Справочники.КолонкиКалендарейСотрудников.КолонкиКалендаряВладельца(Запись.Календарь);  
	УстановитьПривилегированныйРежим(Ложь);
	Элементы.Колонка.СписокВыбора.ЗагрузитьЗначения(ТЗКолонок.ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры  

#КонецОбласти

