
&После("УстановкаПараметровСеанса")
Процедура Пр_УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	СотрудникиПользователя = РегистрыСведений.СотрудникиПользователя.ПолучитьСотрудниковПользователя(ПараметрыСеанса.ТекущийПользователь); 
	Если СотрудникиПользователя.Количество() Тогда	
		ПараметрыСеанса.Пр_ТекущийСотрудник = СотрудникиПользователя[0]; 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТекущиеКадровыеДанныеСотрудниковУНФ.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
			|ИЗ
			|	РегистрСведений.ТекущиеКадровыеДанныеСотрудниковУНФ КАК ТекущиеКадровыеДанныеСотрудниковУНФ
			|ГДЕ
			|	ТекущиеКадровыеДанныеСотрудниковУНФ.Сотрудник = &Сотрудник";
		Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.Пр_ТекущийСотрудник);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПараметрыСеанса.Пр_ТекущееПодразделение = Выборка.СтруктурнаяЕдиница;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры
