#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьВсеIssue(Команда)
	ВыполнитьОперацию("Отправка"); 
КонецПроцедуры   

&НаКлиенте
Процедура ПолучитьВсеIssue(Команда)
	ВыполнитьОперацию("Получение");
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДоступКПроекту(Команда)
	
	Если Не ЗначениеЗаполнено(Проект) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить проект'"),,
													"Проект", 
													Проект); 
		Возврат;
	КонецЕсли;
	ВыполнитьОперацию("Проверка", Проект);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВсеОтложенныеСообщения(Команда)
	ВыполнитьОперацию("ОтправкаСообщений");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьОперацию(Знач Операция, Знач Проект = Неопределено)

	Если Операция = "Отправка" Тогда
		Пр_ОбменGitLabСервер.Пр_ОтправкаОтложенныхIssue();	
	ИначеЕсли Операция = "Получение" Тогда
		Пр_ОбменGitLabСервер.Пр_ОбновлениеВсехIssue();	
	ИначеЕсли Операция = "Проверка" Тогда
		Пр_ОбменGitLabСервер.ПроверитьДоступПроекта(Проект);
	ИначеЕсли Операция = "ОтправкаСообщений" Тогда
		Пр_ОбменGitLabСервер.Пр_ОтправкаОтложенныхСообщений();	
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Операция выполнена'"));

КонецПроцедуры

#КонецОбласти

