#Область ПрограммныйИнтерфейс

// Обработатывает действие кнопки
//
// Параметры:
// ИдентификаторОбсуждения - Строка
// ИмяДействия - Строка
//
Процедура ОбработатьДействиеПанелиКнопокСистемыВзаимодействия(Знач ИдентификаторОбсуждения, Знач ИмяДействия) Экспорт

	Если ИмяДействия = НСтр("ru = 'ОтветитьПовторноОпрос'") Тогда
		
		Пр_БотыСервер.ИнициализацияПовтораОпроса(ИдентификаторОбсуждения);
		
	КонецЕсли;
	
	Если ИмяДействия = НСтр("ru = 'ЗавершитьОпрос'") Тогда
		
		Пр_БотыСервер.ЗавершитьОпрос(ИдентификаторОбсуждения);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти