
&ИзменениеИКонтроль("ИдентификаторОбъектаМетаданных")
Функция Пр_ИдентификаторОбъектаМетаданных(ОписаниеОбъектаМетаданных, ВызыватьИсключение)
	
	#Вставка    	
	ОбъектыРасширения = Новый Соответствие;
	ОбъектыРасширения.Вставить("Правила распределения (Документ)", Метаданные.Документы.Пр_ПравилаРаспределения);     
	
	ТекущийОбъект = ОбъектыРасширения.Получить(ОписаниеОбъектаМетаданных);
	Если ТекущийОбъект <> Неопределено
		 И ТекущийОбъект.РасширениеКонфигурации() <> Неопределено Тогда
		 
		ИдентификаторРасширения = Справочники.ИдентификаторыОбъектовРасширений.НайтиПоНаименованию(ОписаниеОбъектаМетаданных, Истина);
		Если ЗначениеЗаполнено(ИдентификаторРасширения) Тогда
			Возврат ИдентификаторРасширения;
		КонецЕсли;
	КонецЕсли;
	#КонецВставки
	
	Возврат Справочники.ИдентификаторыОбъектовМетаданных.ИдентификаторОбъектаМетаданных(
	ОписаниеОбъектаМетаданных, ВызыватьИсключение);

КонецФункции
