&НаКлиенте
Процедура Пр_ПриОткрытииПосле(Отказ)     
	
	ПодключитьОбработчикОжидания("ПолучитьСообщенияДляОповещения", 15, Ложь); 
	
КонецПроцедуры    

&НаКлиенте
Процедура ПолучитьСообщенияДляОповещения()

	МассивСообщений = Пр_УведомленияКаледнарейВызовСервераПривилегированный.ПолучитьСообщения();
	
	МассивПрочитанных = Новый Массив;
	
	Для Каждого Сообщение Из МассивСообщений Цикл
		
		ПоказатьОповещениеПользователя(Сообщение.ТекстСообщения,
									   Сообщение.НавигационнаяСсылка,
									   Сообщение.Получатель,,
									   СтатусОповещенияПользователя.Важное,
									   Строка(Сообщение.УУИДСообщения));
									   
		МассивПрочитанных.Добавить(Сообщение);	

	КонецЦикла;
	
	Пр_УведомленияКаледнарейВызовСервераПривилегированный.ПрочитатьСообщения(МассивПрочитанных); 
			
	
КонецПроцедуры
