#Область ПрограммныйИнтерфейс

// Получает данные проектов с десктоп приложения
//
// Параметры:
// Проект - СправочникСсылка.Проекты - Определенный проект при необходимости
//
Асинх Процедура ПолучитьДанныеПроектов(Проект = Неопределено)
	
	АдресСервера = ОбменМобильноеПриложениеВызовСервера.АдресДесктопПриложения();
	ПустойУУИД = ОбменМобильноеПриложениеВызовСервера.ПустойУникальныйИдентификатор();
		
	Соединение = Новый HTTPСоединение(АдресСервера,, "Администратор", ""); 
	Шаблон = "CompanyManagementGitLabCorp/hs/mobile_api/projects/";
	АдресРесурса = СтрШаблон(Шаблон, ?(ЗначениеЗаполнено(Проект),
									   Проект.УникальныйИдентификатор(),
									   ПустойУУИД));
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-type", "application/json");
	Запрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	Ответ = Ждать Соединение.ПолучитьАсинх(Запрос);  
	ОтветСтрокой = Ответ.ПолучитьТелоКакСтроку();
	Если Ответ.КодСостояния = 200 Тогда
		
		Проекты = ПрочитатьЗначениеJSON(ОтветСтрокой);  
		АдресПроектов = ПоместитьВоВременноеХранилище(Проекты);
		ОбменМобильноеПриложениеВызовСервера.ОбработатьОтвет(АдресПроектов, НСтр("ru = 'Справочник.Проекты'"));
		
	Иначе
		
		Ждать ПредупреждениеАсинх(НСтр("ru = 'Не удалось получить данные по проектам.'"), 0, НСтр("ru = 'Обмен данными'")); 
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти