#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Пр_ПланФактоваяВыработка.Записывать = Истина;
	Движения.Пр_ПланФактоваяВыработка.Очистить();
	Движения.Пр_ПланФактоваяВыработка.Записать();
	
	Для Каждого СтрокаВыработки Из ПлановыеЗначения Цикл
		
		Движение = Движения.Пр_ПланФактоваяВыработка.Добавить();
		Движение.Период = Дата;          
		Движение.Месяц = СтрокаВыработки.Период;
		Движение.Проект = Проект;
		Движение.КоличествоЧасов = СтрокаВыработки.КоличествоЧасов;
		
	КонецЦикла;
	
	Движения.Пр_ПланФактоваяВыработка.Записывать = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли