
&ИзменениеИКонтроль("ПриЗаполненииВидовДоступа")
Процедура Пр_ПриЗаполненииВидовДоступа(ВидыДоступа)

	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Кассы";
	ВидДоступа.Представление = НСтр("ru = 'Кассы'");
	ВидДоступа.ТипЗначений = Тип("СправочникСсылка.Кассы");

	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ГруппыКонтрагентов";
	ВидДоступа.Представление = НСтр("ru = 'Группы контактов и контрагентов'");
	ВидДоступа.ТипЗначений = Тип("СправочникСсылка.Контрагенты");
	ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаКонтрагентов");
	УправлениеДоступом.ДобавитьДополнительныеТипыВидаДоступа(ВидДоступа, Тип("СправочникСсылка.КонтактныеЛица"),
	ВидДоступа.ТипГруппЗначений, );

	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ГруппыЛидов";
	ВидДоступа.Представление = НСтр("ru = 'Группы лидов'");
	ВидДоступа.ТипЗначений = Тип("СправочникСсылка.Лиды");
	ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаЛидов");

	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ВидыДоговоровКредитаИЗайма";
	ВидДоступа.Представление = НСтр("ru = 'Виды договоров кредита и займа'");
	ВидДоступа.ТипЗначений = Тип("ПеречислениеСсылка.ВидыДоговоровКредитаИЗайма");

	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Организации";
	ВидДоступа.Представление = НСтр("ru = 'Организации'");
	ВидДоступа.ТипЗначений = Тип("СправочникСсылка.Организации");

	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "БанковскиеСчета";
	ВидДоступа.Представление = НСтр("ru = 'Банковские счета'");
	ВидДоступа.ТипЗначений = Тип("СправочникСсылка.БанковскиеСчета");

	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "КассыККМ";
	ВидДоступа.Представление = НСтр("ru = 'Кассы ККМ'");
	ВидДоступа.ТипЗначений = Тип("СправочникСсылка.КассыККМ");

	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ВидыЦен";
	ВидДоступа.Представление = НСтр("ru = 'Виды цен'");
	ВидДоступа.ТипЗначений = Тип("СправочникСсылка.ВидыЦен");
	
	#Удаление
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Склады";
	ВидДоступа.Представление = НСтр("ru = 'Склады и магазины'");    
	ВидДоступа.ТипЗначений = Тип("СправочникСсылка.СтруктурныеЕдиницы");
	#КонецУдаления   
	
	// Физические лица.
	Если ВидыДоступа.Найти("ГруппыФизическихЛиц", "Имя") = Неопределено Тогда
		ВидДоступа = ВидыДоступа.Добавить();
		ВидДоступа.Имя = "ГруппыФизическихЛиц";
		ВидДоступа.Представление = НСтр("ru = 'Группы физических лиц'");
		ВидДоступа.ТипЗначений = Тип("СправочникСсылка.ФизическиеЛица");
		ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаФизическихЛиц");
	КонецЕсли;

	// Подразделения организаций.
	Если ВидыДоступа.Найти("ПодразделенияОрганизаций", "Имя") = Неопределено Тогда
		ВидДоступа = ВидыДоступа.Добавить();
		ВидДоступа.Имя = "ПодразделенияОрганизаций";
		ВидДоступа.Представление = НСтр("ru = 'Подразделения организаций'");
		ВидДоступа.ТипЗначений = Тип("СправочникСсылка.ПодразделенияОрганизаций");
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ОписатьПрофиль_Продажи")
Процедура Пр_ОписатьПрофиль_Продажи(ОписанияПрофилей)

	Аннотация = НСтр("ru = 'Под профилем осуществляется работа с разделами CRM, Продажи и Работы.'");

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильПродажи());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Продажи'");
	ОписаниеПрофиля.Описание = Аннотация;

	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	ДополнитьПрофильКлючевымиРолями(ОписаниеПрофиля);
	ДополнитьПрофильОсновнымиРолями(ОписаниеПрофиля);

	// БСП, БТС
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиССайтами");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеСинхронизацииДанных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭлектроннойПодписиВМоделиСервиса");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");

	// БРД
	ОписаниеПрофиля.Роли.Добавить("РаспознаваниеДокументов");

	// Обмен электронными документами
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРаботаСНоменклатурой");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМЧДЭДО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменаСКонтрагентами");

	// Бизнес-сеть
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");

	// Торговые предложения
	ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложенийБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекТорговыхПредложений");

	// Интернет-поддержка пользователей
	ОписаниеПрофиля.Роли.Добавить("НастройкаПодключенияКСБП");
	ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеИнтернетПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервиса1СТакском");
	ОписаниеПрофиля.Роли.Добавить("ЗапросНовойСправкиСПАРКРиски");
	ОписаниеПрофиля.Роли.Добавить("ПолучениеОбновленийКлассификаторов");
	ОписаниеПрофиля.Роли.Добавить("ПостановкаКонтрагентовНаМониторингСПАРКРиски");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрИнформацииОДоступныхОбновленияхПрограммы");

	// Доставка
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСервисДоставки");
	ОписаниеПрофиля.Роли.Добавить("ОтправкаЗаказовНаДоставкуПеревозчикуСервисДоставки");

	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИСНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладныхЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОПланируемомИмпортеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОбИмпортеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовПостановкиНаБалансЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачВРегистр2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовИзРегистра2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладныхЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияМеждуРегистрамиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияПоСправке2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИнформацияОбОрганизацииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсторияСправок2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаНеобработанныеТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОбработанныеЧекиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСводныйОтчетЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСопоставлениеКлассификаторовЕГАИС");

	// ВЕТИС
	ДополнитьПрофильРолямиВЕТИС(ОписаниеПрофиля);

	// ИСМП
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменаИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборТабачнойПродукцииМОТП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборПродукцииИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПовторнаяПечатьКодовМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыводИзОборотаИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписаниеКодовМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриемкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаКодыМаркировкиДляДекларацииИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтгрузкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратВОборотИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУточнениеСведенийОКодахМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("РазрешитьКодыМаркировкиСОшибкамиПроверкиНаККТ");

	// Зерно
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросОстатковПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОформлениеСДИЗЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСобранныйУрожайЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписаниеПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФормированиеПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФормированиеПартийИзДругихПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтветственныхПодписаниеСообщенийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменаЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриДвиженииЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросОстатковПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПогашениеСДИЗЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФормированиеПартийПриПроизводствеЗЕРНО");

	// УНФ
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиСМобильнымПриложением");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСегментовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСегментовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПричинОтменыЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСерийНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТегов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновНаименований");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновНомеровСерий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеНастроекВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеОсновныхПодписейПисем");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКонтактЦентра");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("СинхронизацияСМобильнымПриложением");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанкаИКассы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовЦенКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЖурналаПроводок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗапасовИРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДействующихПравилРасчетаПремий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилРасчетаПремийПоЛичнымПродажам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУсловийНачисленияПремийПоЛичнымПродажам");

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБиллинга");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафиковИРесурсов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛидов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНаправленийДеятельности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСобытийИЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновПечатиОфисныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКалендаряСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравилРабочегоПроцесса");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилРабочегоПроцесса");

	// ГИСМ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОбОтгрузкеМаркированныхТоваровГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОСписанииКиЗГИСМ");
	ОписаниеПрофиля.Роли.Добавить("НастройкиОбменаГИСМ");

	// УНФ Работа с файлами
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");

	// УНФ Продажи
	ДополнитьРозничнымиПродажами(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАвтоматическихСкидок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБонусов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимозачетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовЗаказовПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовИШаблоновДисконтныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовСкидокИНаценок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДисконтныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхУсловий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокРеализации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаршрутныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМассовыхРассылок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНачисленияСписанияБонусныхБаллов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНомеровГТД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовКомиссионера");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовКомиссионераОСписании");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПереоценкиТоваровНаКомиссии");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановПродаж");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПрайсЛистов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРезервированийЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСверокВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовНаОплату");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактур");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУсловийПредоставленияСкидокНаценок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЦенникиКПечати");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЦеновыхГрупп");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭтаповРемонта");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеЕстьАвтоматическиеСкидки");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиДисконтныеКарты");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПечатьЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчетовПродажи");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияСерийНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаЗапасыПереданные");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиНаборов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаРасчетыСКомиссионерами");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСебестоимость");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиАналитика");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиВзаиморасчеты");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиДоставка");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиПланирование");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиРасчетыСПокупателями");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиСправочники");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиТоварыИУслуги");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиЦеныИСкидки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДисконтныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриходныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродажИКомиссии");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроектов");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиБиллинг");
	ОписаниеПрофиля.Роли.Добавить("РазделCRM");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMАналитика");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMЗаказыИСчета");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMКаналыПродаж");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMПланирование");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMСобытия");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMТоварыИУслуги");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаCRM");

	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОрдерныеСклады");

	// УНФ Работы
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовРесурсовПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновЗаполненияГрафиковРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчетовРаботы");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаРаботы");
	ОписаниеПрофиля.Роли.Добавить("РазделРаботы");
	ОписаниеПрофиля.Роли.Добавить("РазделРаботыАналитика");
	ОписаниеПрофиля.Роли.Добавить("РазделРаботыВзаиморасчеты");
	ОписаниеПрофиля.Роли.Добавить("РазделРаботыЗадания");
	ОписаниеПрофиля.Роли.Добавить("РазделРаботыСправочники");
	ОписаниеПрофиля.Роли.Добавить("РазделРаботыПланирование");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПланированияРесурсов");

	ДополнитьРемонтами(ОписаниеПрофиля);

	// Яндекс.Касса
	ОписаниеПрофиля.Роли.Добавить("ПолучениеПлатежнойСсылкиДляОнлайнОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменовОнлайнОплаты");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовОнлайнОплаты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменовОнлайнОплаты");

	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");     
	#Удаление
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");      
	#КонецУдаления      
	#Вставка
	ОписаниеПрофиля.ВидыДоступа.Добавить("СтруктурныеЕдиницы", "ВначалеВсеРазрешены");      
	#КонецВставки
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыЛидов", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("БанковскиеСчета", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");

	// РМК
	ОписаниеПрофиля.Роли.Добавить("ПравоРучнаяСкидкаРМК");
	ОписаниеПрофиля.Роли.Добавить("ПравоУдалитьСтрокуРМК");
	ОписаниеПрофиля.Роли.Добавить("ПравоУдалитьЧекРМК");
	ОписаниеПрофиля.Роли.Добавить("ПравоЧекНаВозвратРМК");
	ОписаниеПрофиля.Роли.Добавить("ПравоЧекКоррекцииРМК");
	ОписаниеПрофиля.Роли.Добавить("ПравоИзменятьЦенуРМК");
	ОписаниеПрофиля.Роли.Добавить("ПравоРедактироватьКартуРМК");
	ОписаниеПрофиля.Роли.Добавить("РазрешитьОплатуВозвратБезПодтвержденияОтПлатежнойСистемы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУсловийОграниченияПродажРМК");

	// БСЛ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСерверЛояльности");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

КонецПроцедуры

&ИзменениеИКонтроль("ОписатьПрофиль_Закупки")
Процедура Пр_ОписатьПрофиль_Закупки(ОписанияПрофилей)

	Аннотация = НСтр("ru = 'Под профилем осуществляется работа с разделом Закупки.'");

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильЗакупки());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Закупки'");
	ОписаниеПрофиля.Описание = Аннотация;

	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	ДополнитьПрофильКлючевымиРолями(ОписаниеПрофиля);
	ДополнитьПрофильОсновнымиРолями(ОписаниеПрофиля);

	// БСП, БТС
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиССайтами");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеСинхронизацииДанных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭлектроннойПодписиВМоделиСервиса");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");

	// БРД
	ОписаниеПрофиля.Роли.Добавить("РаспознаваниеДокументов");

	// Обмен электронными документами
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМЧДЭДО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменаСКонтрагентами");

	// Бизнес-сеть
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");

	// Торговые предложения
	ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложенийБизнесСеть");

	// Интернет-поддержка пользователей
	ОписаниеПрофиля.Роли.Добавить("ПодключениеИнтернетПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервиса1СТакском");
	ОписаниеПрофиля.Роли.Добавить("ПолучениеОбновленийКлассификаторов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрИнформацииОДоступныхОбновленияхПрограммы");

	// Доставка
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСервисДоставки");
	ОписаниеПрофиля.Роли.Добавить("ОтправкаЗаказовНаДоставкуПеревозчикуСервисДоставки");

	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовПостановкиНаБалансЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовИзРегистра2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачВРегистр2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИСНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладныхЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОПланируемомИмпортеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОбИмпортеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОПланируемомИмпортеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОбИмпортеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОПроизводствеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовПостановкиНаБалансЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачВРегистр2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовИзРегистра2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладныхЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияМеждуРегистрамиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияПоСправке2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИнформацияОбОрганизацииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсторияСправок2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаНеобработанныеТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОбработанныеЧекиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСводныйОтчетЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСопоставлениеКлассификаторовЕГАИС");

	// ГИСМ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваГИСМ");
	ОписаниеПрофиля.Роли.Добавить("НастройкиОбменаГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЗакупкиГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаркировокТоваровГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОПоступленииМаркированныхТоваровГИСМ");

	// ВЕТИС
	ДополнитьПрофильРолямиВЕТИС(ОписаниеПрофиля);

	// ИСМП
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменаИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборТабачнойПродукцииМОТП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборПродукцииИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПовторнаяПечатьКодовМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаркировкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремаркировкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказНаЭмиссиюКодовМаркировкиСУЗ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриемкаТоваровИСМП");

	// Зерно
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросОстатковПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОбИмпортеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПогашениеСДИЗЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСобранныйУрожайЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписаниеПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОПланируемомИмпортеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФормированиеПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФормированиеПартийИзДругихПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтветственныхПодписаниеСообщенийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменаЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриДвиженииЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОформлениеСДИЗЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФормированиеПартийПриПроизводствеЗЕРНО");

	// УНФ
	ДополнитьДобавлениеИзменениеНоменклатуры(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиСМобильнымПриложением");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСегментовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТегов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновНомеровСерий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновНаименований");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеНастроекВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеОсновныхПодписейПисем");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанкаИКассы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовДвиженияПоЗапасам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗапасовИРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеОчередиРасчетаЦен");

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафиковИРесурсов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСобытийИЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновПечатиОфисныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКалендаряСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилРабочегоПроцесса");

	// УНФ Работа с файлами
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");

	// УНФ Закупки
	ДополнитьВозвратамиПоставщикам(ОписаниеПрофиля);
	ДополнитьДобавлениемИзменениемЦенНоменклатуры(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимозачетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовЦен");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовЦенКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРасходов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокПоступления");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНомеровГТД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПрайсЛистов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПрайсЛистовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриходныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходовПриИмпорте");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРезервированийЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСверокВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписанийПроданныхПодарочныхСертификатов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовНаОплатуПоставщика");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиВыгрузкаБазыТоваровВТСД");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиРасчетПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовРасчетаПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУдалениеСопоставлениеОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиФормированиеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчетовЗакупки");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаЗакупки");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияСерийНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИзлишкиИНедостачи");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиНаборов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСебестоимость");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСклад");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСкладПоСериямНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупкиАналитика");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупкиВзаиморасчеты");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупкиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупкиПланирование");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупкиРасчетыСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупкиСправочники");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупкиТоварыИУслуги");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупкиЦены");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиВозвраты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАвтоматическихСкидок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСерверЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоЗапасам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗакупок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасходныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладскихАктов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактур");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатурыКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦеновыхГрупп");

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовПереработчика");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупкиПереработка");

	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОрдерныеСклады");

	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	#Удаление
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");      
	#КонецУдаления      
	#Вставка
	ОписаниеПрофиля.ВидыДоступа.Добавить("СтруктурныеЕдиницы", "ВначалеВсеРазрешены");      
	#КонецВставки
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("БанковскиеСчета", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

КонецПроцедуры

&ИзменениеИКонтроль("ОписатьПрофиль_Склад")
Процедура Пр_ОписатьПрофиль_Склад(ОписанияПрофилей)

	Аннотация = НСтр("ru = 'Под профилем осуществляется работа с разделом Склад.'");

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильСклад());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Склад'");
	ОписаниеПрофиля.Описание = Аннотация;

	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	ДополнитьПрофильКлючевымиРолями(ОписаниеПрофиля);
	ДополнитьПрофильОсновнымиРолями(ОписаниеПрофиля);

	// БСП, БТС
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиССайтами");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеСинхронизацииДанных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭлектроннойПодписиВМоделиСервиса");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");

	// Обмен электронными документами
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМЧДЭДО");

	// Бизнес-сеть
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");

	// Торговые предложения
	ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложенийБизнесСеть");

	// Интернет-поддержка пользователей
	ОписаниеПрофиля.Роли.Добавить("ПодключениеИнтернетПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервиса1СТакском");
	ОписаниеПрофиля.Роли.Добавить("ПолучениеОбновленийКлассификаторов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрИнформацииОДоступныхОбновленияхПрограммы");

	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовПостановкиНаБалансЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовИзРегистра2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачВРегистр2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИСНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОПланируемомИмпортеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОбИмпортеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОПроизводствеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОПланируемомИмпортеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОбИмпортеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОПроизводствеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовПостановкиНаБалансЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачВРегистр2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовИзРегистра2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияМеждуРегистрамиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияПоСправке2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИнформацияОбОрганизацииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсторияСправок2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаНеобработанныеТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОбработанныеЧекиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСводныйОтчетЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСопоставлениеКлассификаторовЕГАИС");

	// ГИСМ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваГИСМ");
	ОписаниеПрофиля.Роли.Добавить("НастройкиОбменаГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЗакупкиГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаркировокТоваровГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОПоступленииМаркированныхТоваровГИСМ");

	// ВЕТИС
	ДополнитьПрофильРолямиВЕТИС(ОписаниеПрофиля);

	// ИСМП
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменаИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборТабачнойПродукцииМОТП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборПродукцииИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПовторнаяПечатьКодовМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаркировкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремаркировкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказНаЭмиссиюКодовМаркировкиСУЗ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриемкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаКодыМаркировкиДляДекларацииИСМП");

	// Зерно
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросОстатковПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСобранныйУрожайЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписаниеПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФормированиеПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФормированиеПартийИзДругихПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтветственныхПодписаниеСообщенийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменаЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриДвиженииЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОформлениеСДИЗЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПогашениеСДИЗЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФормированиеПартийПриПроизводствеЗЕРНО");

	// УНФ
	ДополнитьДобавлениеИзменениеНоменклатуры(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиСМобильнымПриложением");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТегов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеОсновныхПодписейПисем");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЗагрузкиДанныхИзВнешнегоИсточника");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовЦенКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатурыКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовДвиженияПоЗапасам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗапасовИРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОчередиРасчетаЦен");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриходныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочты");

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСобытийИЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКалендаряСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновПечатиОфисныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилРабочегоПроцесса");

	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОрдерныеСклады");

	// УНФ Работа с файлами
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");

	// УНФ Склад
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОприходованийЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПересортицЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКомплектацийЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРезервированийЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСкладскихОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписанийЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиВыгрузкаБазыТоваровВТСД");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПечатьЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаВедомостьПоТоварамНаСкладахВЦенахНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияСерийНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаЗаказыНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаЗапасы");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаЗапасыПереданные");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИзлишкиИНедостачи");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиНаборов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСклад");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСклад");
	ОписаниеПрофиля.Роли.Добавить("РазделСклад");
	ОписаниеПрофиля.Роли.Добавить("РазделСкладАналитика");
	ОписаниеПрофиля.Роли.Добавить("РазделСкладГИСМ");
	ОписаниеПрофиля.Роли.Добавить("РазделСкладЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("РазделСкладТоварыИУслуги");
	ОписаниеПрофиля.Роли.Добавить("РазделСкладПланирование");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАвтоматическихСкидок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСерверЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСклада");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладскихАктов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийПоЯчейкам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиРасчетПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовРасчетаПотребностей");

	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	#Удаление
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");      
	#КонецУдаления      
	#Вставка
	ОписаниеПрофиля.ВидыДоступа.Добавить("СтруктурныеЕдиницы", "ВначалеВсеРазрешены");      
	#КонецВставки
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("БанковскиеСчета", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

КонецПроцедуры

&ИзменениеИКонтроль("ОписатьПрофиль_Производство")
Процедура Пр_ОписатьПрофиль_Производство(ОписанияПрофилей)

	Аннотация = НСтр("ru = 'Под профилем осуществляется работа с разделом Производство.'");

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильПроизводство());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Производство'");
	ОписаниеПрофиля.Описание = Аннотация;

	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	ДополнитьПрофильКлючевымиРолями(ОписаниеПрофиля);
	ДополнитьПрофильОсновнымиРолями(ОписаниеПрофиля);

	// БСП, БТС
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиССайтами");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеСинхронизацииДанных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭлектроннойПодписиВМоделиСервиса");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");

	// Обмен электронными документами
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМЧДЭДО");

	// Интернет-поддержка пользователей
	ОписаниеПрофиля.Роли.Добавить("ПодключениеИнтернетПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервиса1СТакском");
	ОписаниеПрофиля.Роли.Добавить("ПолучениеОбновленийКлассификаторов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрИнформацииОДоступныхОбновленияхПрограммы");

	// ГИСМ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	ОписаниеПрофиля.Роли.Добавить("НастройкиОбменаГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаркировокТоваровГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОСписанииКиЗГИСМ");

	// ВЕТИС
	ДополнитьПрофильРолямиВЕТИС(ОписаниеПрофиля);

	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОПроизводствеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОПроизводствеЕГАИС");

	// ИСМП
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаркировкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремаркировкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыводИзОборотаИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписаниеКодовМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказНаЭмиссиюКодовМаркировкиСУЗ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтгрузкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриемкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУточнениеСведенийОКодахМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборПродукцииИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборТабачнойПродукцииМОТП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиРезультатыСверкиКодовМаркировкиТОРГ2ИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриМаркировкеТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаКодыМаркировкиДляДекларацииИСМП");

	// Зерно
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросОстатковПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСобранныйУрожайЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписаниеПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФормированиеПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФормированиеПартийИзДругихПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФормированиеПартийПриПроизводствеЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтветственныхПодписаниеСообщенийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменаЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриДвиженииЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОформлениеСДИЗЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПогашениеСДИЗЗЕРНО");

	// УНФ
	ДополнитьДобавлениеИзменениеНоменклатуры(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиСМобильнымПриложением");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафиковИРесурсов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСобытийИЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновНаименований");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновНомеровСерий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновЗаполненияГрафиковРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеОсновныхПодписейПисем");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКалендаряСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАвтоматическихСкидок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСерверЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанкаИКассы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБонусов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовЦенКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовДвиженияПоЗапасам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЖурналаПроводок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗапасовИРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОчередиРасчетаЦен");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилРабочегоПроцесса");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрайсЛистовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатурыКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУсловийПредоставленияСкидокНаценок");

	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОрдерныеСклады");

	// УНФ Работа с файлами
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");

	// УНФ Производство
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовРесурсовПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОПереработке");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенийЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСборокЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСдельныхНарядов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактур");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭтаповПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеРучногоРаспределенияМатериаловПоУмолчанию");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиВыполнениеЭтапов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиРасчетПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовРасчетаПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчетовПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСебестоимость");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводство");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводствоАналитика");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводствоЗаданияИНаряды");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводствоПереработка");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводствоПланирование");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводствоСправочники");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПланированияРесурсов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводства");

	ДополнитьРемонтами(ОписаниеПрофиля);

	// Яндекс.Касса
	ОписаниеПрофиля.Роли.Добавить("ПолучениеПлатежнойСсылкиДляОнлайнОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменовОнлайнОплаты");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовОнлайнОплаты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменовОнлайнОплаты");

	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	#Удаление
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");      
	#КонецУдаления      
	#Вставка
	ОписаниеПрофиля.ВидыДоступа.Добавить("СтруктурныеЕдиницы", "ВначалеВсеРазрешены");      
	#КонецВставки
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("БанковскиеСчета", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

КонецПроцедуры

&ИзменениеИКонтроль("ОписатьПрофиль_РабочееМестоСтаршегоКассира")
Процедура Пр_ОписатьПрофиль_РабочееМестоСтаршегоКассира(ОписанияПрофилей)

	Аннотация = НСтр(
	"ru = 'Профиль для рабочего места старшего кассира. Отличается от профиля операционного кассира возможностью добавлять контрагентов и оформлять возвраты покупателям.'");

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильРабочееМестоСтаршегоКассира());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Рабочее место старшего кассира'");
	ОписаниеПрофиля.Описание = Аннотация;

	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	ДополнитьПрофильКлючевымиРолями(ОписаниеПрофиля);

	// БСП
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхШаблоновСообщений");

	// Обмен электронными документами
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМЧДЭДО");

	// УНФ
	ДополнитьВозвратамиОтПокупателей(ОписаниеПрофиля);
	ДополнитьРозничнымиПродажами(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиСМобильнымПриложением");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЦенникиКПечати");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеНастроекВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПечатьЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗапасовИРасчетов");

	// УНФ Работа с файлами
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");

	// Интернет-поддержка пользователей
	ОписаниеПрофиля.Роли.Добавить("НастройкаПодключенияКСБП");
	ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");

	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладныхЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияПоСправке2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИнформацияОбОрганизацииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсторияСправок2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОбработанныеЧекиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековЕГАИСНаВозврат");

	// ВЕТИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВЕТИС");

	// ГИСМ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваГИСМ");

	// ИСМП
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменаИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборТабачнойПродукцииМОТП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборПродукцииИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПовторнаяПечатьКодовМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("РазрешитьКодыМаркировкиСОшибкамиПроверкиНаККТ");

	// Зерно
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗЕРНО");

	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	#Удаление
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");      
	#КонецУдаления      
	#Вставка
	ОписаниеПрофиля.ВидыДоступа.Добавить("СтруктурныеЕдиницы", "ВначалеВсеРазрешены");      
	#КонецВставки
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("БанковскиеСчета", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");

	// РМК
	ОписаниеПрофиля.Роли.Добавить("ПрофильРабочееМестоКассира");
	ОписаниеПрофиля.Роли.Добавить("ПравоРучнаяСкидкаРМК");
	ОписаниеПрофиля.Роли.Добавить("ПравоУдалитьСтрокуРМК");
	ОписаниеПрофиля.Роли.Добавить("ПравоУдалитьЧекРМК");
	ОписаниеПрофиля.Роли.Добавить("ПравоЧекНаВозвратРМК");
	ОписаниеПрофиля.Роли.Добавить("ПравоЧекКоррекцииРМК");
	ОписаниеПрофиля.Роли.Добавить("ПравоИзменятьЦенуРМК");
	ОписаниеПрофиля.Роли.Добавить("ПравоРедактироватьКартуРМК");
	ОписаниеПрофиля.Роли.Добавить("РазрешитьОплатуВозвратБезПодтвержденияОтПлатежнойСистемы");

	// БСЛ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСерверЛояльности");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

КонецПроцедуры

&ИзменениеИКонтроль("ОписатьПрофиль_РабочееМестоОперационногоКассира")
Процедура Пр_ОписатьПрофиль_РабочееМестоОперационногоКассира(ОписанияПрофилей)

	Аннотация = НСтр("ru = 'Профиль для рабочего места операционного кассира
	|Под данным профилем доступна работа только с формой рабочего места кассира и заказами покупателей при соответствующей включенной опции.'");

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильРабочееМестоОперационногоКассира());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Рабочее место операционного кассира'");
	ОписаниеПрофиля.Описание = Аннотация;

	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	ДополнитьПрофильКлючевымиРолями(ОписаниеПрофиля);

	// БСП
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхШаблоновСообщений");

	// Обмен электронными документами
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМЧДЭДО");

	// УНФ
	ДополнитьРозничнымиПродажами(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиСМобильнымПриложением");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЦенникиКПечати");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПечатьЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗапасовИРасчетов");

	// УНФ Работа с файлами
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");

	// Интернет-поддержка пользователей
	ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");

	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладныхЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияПоСправке2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИнформацияОбОрганизацииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсторияСправок2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОбработанныеЧекиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековЕГАИСНаВозврат");

	// ВЕТИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВЕТИС");

	// ГИСМ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваГИСМ");

	// ИСМП
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменаИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборТабачнойПродукцииМОТП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборПродукцииИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПовторнаяПечатьКодовМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("РазрешитьКодыМаркировкиСОшибкамиПроверкиНаККТ");

	// Зерно
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗЕРНО");

	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	#Удаление
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");      
	#КонецУдаления      
	#Вставка
	ОписаниеПрофиля.ВидыДоступа.Добавить("СтруктурныеЕдиницы", "ВначалеВсеРазрешены");      
	#КонецВставки
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("БанковскиеСчета", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");

	//РМК
	ОписаниеПрофиля.Роли.Добавить("ПрофильРабочееМестоКассира");
	ОписаниеПрофиля.Роли.Добавить("ПравоРедактироватьКартуРМК");

	//БСЛ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСерверЛояльности");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

КонецПроцедуры

&ИзменениеИКонтроль("ОписатьПрофиль_ВозвратыОтПокупателей")
Процедура Пр_ОписатьПрофиль_ВозвратыОтПокупателей(ОписанияПрофилей)

	Аннотация = НСтр("ru = 'Предоставляет возможность работы с возвратами от покупателей.'");

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильВозвратыОтПокупателей());
	ОписаниеПрофиля.Родитель = ГруппаДополнительныеПрофили();
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Возвраты от покупателей (дополнительно)'");
	ОписаниеПрофиля.Описание = Аннотация;

	ДополнитьВозвратамиОтПокупателей(ОписаниеПрофиля);

	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	#Удаление
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");      
	#КонецУдаления      
	#Вставка
	ОписаниеПрофиля.ВидыДоступа.Добавить("СтруктурныеЕдиницы", "ВначалеВсеРазрешены");      
	#КонецВставки
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыЛидов", "ВначалеВсеЗапрещены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

КонецПроцедуры

&ИзменениеИКонтроль("ОписатьПрофиль_ВозвратыПоставщикам")
Процедура Пр_ОписатьПрофиль_ВозвратыПоставщикам(ОписанияПрофилей)

	Аннотация = НСтр("ru = 'Предоставляет возможность работы с возвратами поставщикам.'");

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильВозвратыПоставщикам());
	ОписаниеПрофиля.Родитель = ГруппаДополнительныеПрофили();
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Возвраты поставщикам (дополнительно)'");
	ОписаниеПрофиля.Описание = Аннотация;

	ДополнитьВозвратамиПоставщикам(ОписаниеПрофиля);

	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	#Удаление
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");      
	#КонецУдаления      
	#Вставка
	ОписаниеПрофиля.ВидыДоступа.Добавить("СтруктурныеЕдиницы", "ВначалеВсеРазрешены");      
	#КонецВставки
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеЗапрещены");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

КонецПроцедуры

&ИзменениеИКонтроль("ВидыОграниченийПравДокументов")
Функция Пр_ВидыОграниченийПравДокументов()
	
	#Удаление
	Результат =
	"Документ.АвансовыйОтчет.Изменение.ГруппыКонтрагентов
	|Документ.АвансовыйОтчет.Изменение.Организации
	|Документ.АвансовыйОтчет.Чтение.ГруппыКонтрагентов
	|Документ.АвансовыйОтчет.Чтение.Организации
	|Документ.АктВыполненныхРабот.Изменение.ГруппыКонтрагентов
	|Документ.АктВыполненныхРабот.Изменение.Организации
	|Документ.АктВыполненныхРабот.Чтение.ГруппыКонтрагентов
	|Документ.АктВыполненныхРабот.Чтение.Организации
	|Документ.АктОРасхождениях.Изменение.ГруппыКонтрагентов
	|Документ.АктОРасхождениях.Изменение.Организации
	|Документ.АктОРасхождениях.Изменение.Склады
	|Документ.АктОРасхождениях.Чтение.ГруппыКонтрагентов
	|Документ.АктОРасхождениях.Чтение.Организации
	|Документ.АктОРасхождениях.Чтение.Склады
	|Документ.АктОРасхожденияхПолученный.Изменение.ГруппыКонтрагентов
	|Документ.АктОРасхожденияхПолученный.Изменение.Организации
	|Документ.АктОРасхожденияхПолученный.Изменение.Склады
	|Документ.АктОРасхожденияхПолученный.Чтение.ГруппыКонтрагентов
	|Документ.АктОРасхожденияхПолученный.Чтение.Организации
	|Документ.АктОРасхожденияхПолученный.Чтение.Склады
	|Документ.АктПостановкиНаБалансЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.АктПостановкиНаБалансЕГАИС.Изменение.Организации
	|Документ.АктПостановкиНаБалансЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.АктПостановкиНаБалансЕГАИС.Чтение.Организации
	|Документ.АктСписанияЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.АктСписанияЕГАИС.Изменение.Организации
	|Документ.АктСписанияЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.АктСписанияЕГАИС.Чтение.Организации
	|Документ.АмортизацияВА.Изменение.Организации
	|Документ.АмортизацияВА.Чтение.Организации
	|Документ.ВводНачальныхОстатков.Чтение.Организации
	|Документ.Взаимозачет.Изменение.ГруппыКонтрагентов
	|Документ.Взаимозачет.Изменение.Организации
	|Документ.Взаимозачет.Чтение.ГруппыКонтрагентов
	|Документ.Взаимозачет.Чтение.Организации
	|Документ.ВнесениеНаличных.Изменение.КассыККМ
	|Документ.ВнесениеНаличных.Изменение.Организации
	|Документ.ВнесениеНаличных.Чтение.КассыККМ
	|Документ.ВнесениеНаличных.Чтение.Организации
	|Документ.ВнесениеСведенийОСобранномУрожаеЗЕРНО.Чтение.Организации
	|Документ.ВнесениеСведенийОСобранномУрожаеЗЕРНО.Изменение.Организации
	|Документ.ВозвратВОборотИСМП.Чтение.Организации
	|Документ.ВозвратВОборотИСМП.Изменение.Организации
	|Документ.ВозвратИзРегистра2ЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ВозвратИзРегистра2ЕГАИС.Изменение.Организации
	|Документ.ВозвратИзРегистра2ЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ВозвратИзРегистра2ЕГАИС.Чтение.Организации
	|Документ.ВыводИзОборотаИСМП.Изменение.Организации
	|Документ.ВыводИзОборотаИСМП.Чтение.Организации
	|Документ.ВыгрузкаРегламентированныхОтчетов.Изменение.Организации
	|Документ.ВыгрузкаРегламентированныхОтчетов.Чтение.Организации
	|Документ.ВыемкаНаличных.Изменение.КассыККМ
	|Документ.ВыемкаНаличных.Изменение.Организации
	|Документ.ВыемкаНаличных.Чтение.КассыККМ
	|Документ.ВыемкаНаличных.Чтение.Организации
	|Документ.ВыработкаВА.Изменение.Организации
	|Документ.ВыработкаВА.Чтение.Организации
	|Документ.Доверенность.Изменение.ГруппыКонтрагентов
	|Документ.Доверенность.Изменение.Организации
	|Документ.Доверенность.Чтение.ГруппыКонтрагентов
	|Документ.Доверенность.Чтение.Организации
	|Документ.ДоговорКредитаИЗайма.Чтение.ВидыДоговоровКредитаИЗайма
	|Документ.ДоговорКредитаИЗайма.Чтение.ГруппыКонтрагентов
	|Документ.ДоговорКредитаИЗайма.Чтение.Организации
	|Документ.ДоговорКредитаИЗайма.Изменение.ВидыДоговоровКредитаИЗайма
	|Документ.ДоговорКредитаИЗайма.Изменение.ГруппыКонтрагентов
	|Документ.ДоговорКредитаИЗайма.Изменение.Организации
	|Документ.ДополнительныеРасходы.Изменение.ГруппыКонтрагентов
	|Документ.ДополнительныеРасходы.Изменение.Организации
	|Документ.ДополнительныеРасходы.Изменение.Склады
	|Документ.ДополнительныеРасходы.Чтение.ГруппыКонтрагентов
	|Документ.ДополнительныеРасходы.Чтение.Организации
	|Документ.ДополнительныеРасходы.Чтение.Склады
	|Документ.ЗаданиеНаРаботу.Изменение.Организации
	|Документ.ЗаданиеНаРаботу.Чтение.Организации
	|Документ.ЗаказНаПеремещение.Изменение.Организации
	|Документ.ЗаказНаПеремещение.Изменение.Склады
	|Документ.ЗаказНаПеремещение.Чтение.Организации
	|Документ.ЗаказНаПеремещение.Чтение.Склады
	|Документ.ЗаказНаПроизводство.Изменение.ГруппыКонтрагентов
	|Документ.ЗаказНаПроизводство.Изменение.Организации
	|Документ.ЗаказНаПроизводство.Чтение.ГруппыКонтрагентов
	|Документ.ЗаказНаПроизводство.Чтение.Организации
	|Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Изменение.Организации
	|Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Чтение.Организации
	|Документ.ЗаказПокупателя.Изменение.ГруппыКонтрагентов
	|Документ.ЗаказПокупателя.Изменение.Организации
	|Документ.ЗаказПокупателя.Чтение.ГруппыКонтрагентов
	|Документ.ЗаказПокупателя.Чтение.Организации
	|Документ.ЗаказПоставщику.Изменение.ГруппыКонтрагентов
	|Документ.ЗаказПоставщику.Изменение.Организации
	|Документ.ЗаказПоставщику.Чтение.ГруппыКонтрагентов
	|Документ.ЗаказПоставщику.Чтение.Организации
	|Документ.ЗакрытиеМесяца.Чтение.Организации
	|Документ.ЗакрытиеМесяца.Изменение.Организации
	|Документ.ЗапросАкцизныхМарокЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ЗапросАкцизныхМарокЕГАИС.Изменение.Организации
	|Документ.ЗапросАкцизныхМарокЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ЗапросАкцизныхМарокЕГАИС.Чтение.Организации
	|Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Изменение.Организации
	|Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Чтение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.Изменение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.Чтение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя.Изменение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя.Чтение.Организации
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Изменение.ГруппыКонтрагентов
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Изменение.Организации
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Чтение.ГруппыКонтрагентов
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Чтение.Организации
	|Документ.ЗапросОстатковПартийЗЕРНО.Чтение.Организации
	|Документ.ЗапросОстатковПартийЗЕРНО.Изменение.Организации
	|Документ.ЗаявлениеАбонентаСпецоператораСвязи.Изменение.Организации
	|Документ.ЗаявлениеАбонентаСпецоператораСвязи.Чтение.Организации
	|Документ.ИзменениеПараметровВА.Изменение.Организации
	|Документ.ИзменениеПараметровВА.Чтение.Организации
	|Документ.ИнвентаризацияЗапасов.Изменение.Организации
	|Документ.ИнвентаризацияЗапасов.Изменение.Склады
	|Документ.ИнвентаризацияЗапасов.Чтение.Организации
	|Документ.ИнвентаризацияЗапасов.Чтение.Склады
	|Документ.КадровоеПеремещениеУНФ.Изменение.Организации
	|Документ.КадровоеПеремещениеУНФ.Чтение.Организации
	|Документ.КассоваяКнига.Изменение.Кассы
	|Документ.КассоваяКнига.Изменение.Организации
	|Документ.КассоваяКнига.Чтение.Кассы
	|Документ.КассоваяКнига.Чтение.Организации
	|Документ.КомплектацияЗапасов.Изменение.Организации
	|Документ.КомплектацияЗапасов.Изменение.Склады
	|Документ.КомплектацияЗапасов.Чтение.Организации
	|Документ.КомплектацияЗапасов.Чтение.Склады
	|Документ.КорректировкаПоступления.Изменение.ГруппыКонтрагентов
	|Документ.КорректировкаПоступления.Изменение.Организации
	|Документ.КорректировкаПоступления.Изменение.Склады
	|Документ.КорректировкаПоступления.Чтение.ГруппыКонтрагентов
	|Документ.КорректировкаПоступления.Чтение.Организации
	|Документ.КорректировкаПоступления.Чтение.Склады
	|Документ.КорректировкаРеализации.Изменение.ГруппыКонтрагентов
	|Документ.КорректировкаРеализации.Изменение.Организации
	|Документ.КорректировкаРеализации.Изменение.Склады
	|Документ.КорректировкаРеализации.Чтение.ГруппыКонтрагентов
	|Документ.КорректировкаРеализации.Чтение.Организации
	|Документ.КорректировкаРеализации.Чтение.Склады
	|Документ.МаркировкаТоваровГИСМ.Изменение.Организации
	|Документ.МаркировкаТоваровГИСМ.Чтение.Организации
	|Документ.МаркировкаТоваровГИСМ.Чтение.Склады
	|Документ.МаркировкаТоваровГИСМ.Изменение.Склады
	|Документ.МаркировкаТоваровИСМП.Изменение.Организации
	|Документ.МаркировкаТоваровИСМП.Чтение.Организации
	|Документ.МаршрутныйЛист.Изменение.Организации
	|Документ.МаршрутныйЛист.Чтение.Организации
	|Документ.МассоваяРассылка.Изменение.ГруппыКонтрагентов
	|Документ.МассоваяРассылка.Чтение.ГруппыКонтрагентов
	|Документ.НачислениеЗарплатыУНФ.Изменение.Организации
	|Документ.НачислениеЗарплатыУНФ.Чтение.Организации
	|Документ.НачислениеНалогов.Изменение.Организации
	|Документ.НачислениеНалогов.Чтение.Организации
	|Документ.НачисленияПоКредитамИЗаймам.Изменение.ГруппыКонтрагентов
	|Документ.НачисленияПоКредитамИЗаймам.Изменение.Организации
	|Документ.НачисленияПоКредитамИЗаймам.Чтение.ГруппыКонтрагентов
	|Документ.НачисленияПоКредитамИЗаймам.Чтение.Организации
	|Документ.ОперацияПоПлатежнымКартам.Изменение.БанковскиеСчета
	|Документ.ОперацияПоПлатежнымКартам.Изменение.ГруппыКонтрагентов
	|Документ.ОперацияПоПлатежнымКартам.Изменение.Организации
	|Документ.ОперацияПоПлатежнымКартам.Чтение.БанковскиеСчета
	|Документ.ОперацияПоПлатежнымКартам.Чтение.ГруппыКонтрагентов
	|Документ.ОперацияПоПлатежнымКартам.Чтение.Организации
	|Документ.ОприходованиеЗапасов.Изменение.Организации
	|Документ.ОприходованиеЗапасов.Изменение.Склады
	|Документ.ОприходованиеЗапасов.Чтение.Организации
	|Документ.ОприходованиеЗапасов.Чтение.Склады
	|Документ.ОстаткиЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ОстаткиЕГАИС.Изменение.Организации
	|Документ.ОстаткиЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ОстаткиЕГАИС.Чтение.Организации
	|Документ.ОтгрузкаТоваровИСМП.Изменение.Организации
	|Документ.ОтгрузкаТоваровИСМП.Чтение.Организации
	|Документ.ОтчетЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ОтчетЕГАИС.Изменение.Организации
	|Документ.ОтчетЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ОтчетЕГАИС.Чтение.Организации
	|Документ.ОтчетКомиссионера.Изменение.ГруппыКонтрагентов
	|Документ.ОтчетКомиссионера.Изменение.Организации
	|Документ.ОтчетКомиссионера.Чтение.ГруппыКонтрагентов
	|Документ.ОтчетКомиссионера.Чтение.Организации
	|Документ.ОтчетКомиссионераОСписании.Изменение.ГруппыКонтрагентов
	|Документ.ОтчетКомиссионераОСписании.Изменение.Организации
	|Документ.ОтчетКомиссионераОСписании.Чтение.ГруппыКонтрагентов
	|Документ.ОтчетКомиссионераОСписании.Чтение.Организации
	|Документ.ОтчетКомитенту.Изменение.ГруппыКонтрагентов
	|Документ.ОтчетКомитенту.Изменение.Организации
	|Документ.ОтчетКомитенту.Чтение.ГруппыКонтрагентов
	|Документ.ОтчетКомитенту.Чтение.Организации
	|Документ.ОтчетОПереработке.Изменение.ГруппыКонтрагентов
	|Документ.ОтчетОПереработке.Изменение.Организации
	|Документ.ОтчетОПереработке.Изменение.Склады
	|Документ.ОтчетОПереработке.Чтение.ГруппыКонтрагентов
	|Документ.ОтчетОПереработке.Чтение.Организации
	|Документ.ОтчетОПереработке.Чтение.Склады
	|Документ.ОтчетОРозничныхПродажах.Изменение.КассыККМ
	|Документ.ОтчетОРозничныхПродажах.Изменение.Организации
	|Документ.ОтчетОРозничныхПродажах.Изменение.Склады
	|Документ.ОтчетОРозничныхПродажах.Чтение.КассыККМ
	|Документ.ОтчетОРозничныхПродажах.Чтение.Организации
	|Документ.ОтчетОРозничныхПродажах.Чтение.Склады
	|Документ.ОтчетПереработчика.Изменение.ГруппыКонтрагентов
	|Документ.ОтчетПереработчика.Изменение.Организации
	|Документ.ОтчетПереработчика.Чтение.ГруппыКонтрагентов
	|Документ.ОтчетПереработчика.Чтение.Организации
	|Документ.ОформлениеСДИЗЗЕРНО.Изменение.Организации
	|Документ.ОформлениеСДИЗЗЕРНО.Чтение.Организации
	|Документ.ПакетОбменСБанками.Чтение.Организации
	|Документ.ПередачаВА.Изменение.ГруппыКонтрагентов
	|Документ.ПередачаВА.Изменение.Организации
	|Документ.ПередачаВА.Чтение.ГруппыКонтрагентов
	|Документ.ПередачаВА.Чтение.Организации
	|Документ.ПередачаВРегистр2ЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ПередачаВРегистр2ЕГАИС.Изменение.Организации
	|Документ.ПередачаВРегистр2ЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ПередачаВРегистр2ЕГАИС.Чтение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.ГруппыКонтрагентов
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.Склады
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.ГруппыКонтрагентов
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.Склады
	|Документ.ПеремаркировкаТоваровГИСМ.Изменение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Чтение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Чтение.Склады
	|Документ.ПеремаркировкаТоваровГИСМ.Изменение.Склады
	|Документ.ПеремаркировкаТоваровИСМП.Изменение.Организации
	|Документ.ПеремаркировкаТоваровИСМП.Чтение.Организации
	|Документ.ПеремещениеДС.Изменение.Кассы
	|Документ.ПеремещениеДС.Изменение.Организации
	|Документ.ПеремещениеДС.Чтение.Кассы
	|Документ.ПеремещениеДС.Чтение.Организации
	|Документ.ПеремещениеДСПлан.Изменение.Кассы
	|Документ.ПеремещениеДСПлан.Изменение.Организации
	|Документ.ПеремещениеДСПлан.Чтение.Кассы
	|Документ.ПеремещениеДСПлан.Чтение.Организации
	|Документ.ПеремещениеЗапасов.Изменение.Организации
	|Документ.ПеремещениеЗапасов.Изменение.Склады
	|Документ.ПеремещениеЗапасов.Чтение.Организации
	|Документ.ПеремещениеЗапасов.Чтение.Склады
	|Документ.ПеремещениеПоЯчейкам.Изменение.Организации
	|Документ.ПеремещениеПоЯчейкам.Изменение.Склады
	|Документ.ПеремещениеПоЯчейкам.Чтение.Организации
	|Документ.ПеремещениеПоЯчейкам.Чтение.Склады
	|Документ.ПереоценкаВРозницеСуммовойУчет.Изменение.Организации
	|Документ.ПереоценкаВРозницеСуммовойУчет.Чтение.Организации
	|Документ.ПереоценкаТоваровНаКомиссии.Изменение.ГруппыКонтрагентов
	|Документ.ПереоценкаТоваровНаКомиссии.Изменение.Организации
	|Документ.ПереоценкаТоваровНаКомиссии.Чтение.ГруппыКонтрагентов
	|Документ.ПереоценкаТоваровНаКомиссии.Чтение.Организации
	|Документ.ПересортицаЗапасов.Изменение.Организации
	|Документ.ПересортицаЗапасов.Изменение.Склады
	|Документ.ПересортицаЗапасов.Чтение.Организации
	|Документ.ПересортицаЗапасов.Чтение.Склады
	|Документ.ПланПродаж.Изменение.Организации
	|Документ.ПланПродаж.Чтение.Организации
	|Документ.ПлатежнаяВедомость.Изменение.Организации
	|Документ.ПлатежнаяВедомость.Чтение.Организации
	|Документ.ПлатежноеПоручение.Изменение.БанковскиеСчета
	|Документ.ПлатежноеПоручение.Изменение.ГруппыКонтрагентов
	|Документ.ПлатежноеПоручение.Изменение.Организации
	|Документ.ПлатежноеПоручение.Чтение.БанковскиеСчета
	|Документ.ПлатежноеПоручение.Чтение.ГруппыКонтрагентов
	|Документ.ПлатежноеПоручение.Чтение.Организации
	|Документ.ПоказателиЕНВД.Изменение.Организации
	|Документ.ПоказателиЕНВД.Чтение.Организации
	|Документ.ПогашениеСДИЗЗЕРНО.Чтение.Организации
	|Документ.ПогашениеСДИЗЗЕРНО.Изменение.Организации
	|Документ.ПоступлениеВКассу.Изменение.БанковскиеСчета
	|Документ.ПоступлениеВКассу.Изменение.ГруппыКонтрагентов
	|Документ.ПоступлениеВКассу.Изменение.Кассы
	|Документ.ПоступлениеВКассу.Изменение.КассыККМ
	|Документ.ПоступлениеВКассу.Изменение.Организации
	|Документ.ПоступлениеВКассу.Чтение.БанковскиеСчета
	|Документ.ПоступлениеВКассу.Чтение.ГруппыКонтрагентов
	|Документ.ПоступлениеВКассу.Чтение.Кассы
	|Документ.ПоступлениеВКассу.Чтение.КассыККМ
	|Документ.ПоступлениеВКассу.Чтение.Организации
	|Документ.ПоступлениеДСПлан.Изменение.ГруппыКонтрагентов
	|Документ.ПоступлениеДСПлан.Изменение.Организации
	|Документ.ПоступлениеДСПлан.Чтение.ГруппыКонтрагентов
	|Документ.ПоступлениеДСПлан.Чтение.Организации
	|Документ.ПоступлениеНаСчет.Изменение.БанковскиеСчета
	|Документ.ПоступлениеНаСчет.Изменение.ГруппыКонтрагентов
	|Документ.ПоступлениеНаСчет.Изменение.Организации
	|Документ.ПоступлениеНаСчет.Чтение.БанковскиеСчета
	|Документ.ПоступлениеНаСчет.Чтение.ГруппыКонтрагентов
	|Документ.ПоступлениеНаСчет.Чтение.Организации
	|Документ.ПоложениеОПремировании.Изменение.Организации
	|Документ.ПоложениеОПремировании.Чтение.Организации
	|Документ.ПоясненияКДекларацииПоНДС.Изменение.Организации
	|Документ.ПоясненияКДекларацииПоНДС.Чтение.Организации
	|Документ.ПриемкаТоваровИСМП.Чтение.Организации
	|Документ.ПриемкаТоваровИСМП.Изменение.Организации
	|Документ.ПриемИПередачаВРемонт.Изменение.ГруппыКонтрагентов
	|Документ.ПриемИПередачаВРемонт.Изменение.Организации
	|Документ.ПриемИПередачаВРемонт.Изменение.Склады
	|Документ.ПриемИПередачаВРемонт.Чтение.ГруппыКонтрагентов
	|Документ.ПриемИПередачаВРемонт.Чтение.Организации
	|Документ.ПриемИПередачаВРемонт.Чтение.Склады
	|Документ.ПриемНаРаботуУНФ.Изменение.Организации
	|Документ.ПриемНаРаботуУНФ.Чтение.Организации
	|Документ.ПринятиеКУчетуВА.Изменение.Организации
	|Документ.ПринятиеКУчетуВА.Изменение.Склады
	|Документ.ПринятиеКУчетуВА.Чтение.Организации
	|Документ.ПринятиеКУчетуВА.Чтение.Склады
	|Документ.ПриходнаяНакладная.Изменение.ГруппыКонтрагентов
	|Документ.ПриходнаяНакладная.Изменение.Организации
	|Документ.ПриходнаяНакладная.Изменение.Склады
	|Документ.ПриходнаяНакладная.Чтение.ГруппыКонтрагентов
	|Документ.ПриходнаяНакладная.Чтение.Организации
	|Документ.ПриходнаяНакладная.Чтение.Склады
	|Документ.ПриходныйОрдер.Изменение.Организации
	|Документ.ПриходныйОрдер.Изменение.Склады
	|Документ.ПриходныйОрдер.Чтение.Организации
	|Документ.ПриходныйОрдер.Чтение.Склады
	|Документ.ПрочиеРасходы.Чтение.ГруппыКонтрагентов
	|Документ.ПрочиеРасходы.Чтение.Организации
	|Документ.РаспределениеЗатрат.Изменение.Организации
	|Документ.РаспределениеЗатрат.Чтение.Организации
	|Документ.РасходДСПлан.Изменение.ГруппыКонтрагентов
	|Документ.РасходДСПлан.Изменение.Организации
	|Документ.РасходДСПлан.Чтение.ГруппыКонтрагентов
	|Документ.РасходДСПлан.Чтение.Организации
	|Документ.РасходИзКассы.Изменение.БанковскиеСчета
	|Документ.РасходИзКассы.Изменение.ГруппыКонтрагентов
	|Документ.РасходИзКассы.Изменение.Кассы
	|Документ.РасходИзКассы.Изменение.КассыККМ
	|Документ.РасходИзКассы.Изменение.Организации
	|Документ.РасходИзКассы.Чтение.БанковскиеСчета
	|Документ.РасходИзКассы.Чтение.ГруппыКонтрагентов
	|Документ.РасходИзКассы.Чтение.Кассы
	|Документ.РасходИзКассы.Чтение.КассыККМ
	|Документ.РасходИзКассы.Чтение.Организации
	|Документ.РасходнаяНакладная.Изменение.ГруппыКонтрагентов
	|Документ.РасходнаяНакладная.Изменение.Организации
	|Документ.РасходнаяНакладная.Изменение.Склады
	|Документ.РасходнаяНакладная.Чтение.ГруппыКонтрагентов
	|Документ.РасходнаяНакладная.Чтение.Организации
	|Документ.РасходнаяНакладная.Чтение.Склады
	|Документ.РасходныйОрдер.Изменение.Организации
	|Документ.РасходныйОрдер.Изменение.Склады
	|Документ.РасходныйОрдер.Чтение.Организации
	|Документ.РасходныйОрдер.Чтение.Склады
	|Документ.РасходСоСчета.Изменение.БанковскиеСчета
	|Документ.РасходСоСчета.Изменение.ГруппыКонтрагентов
	|Документ.РасходСоСчета.Изменение.Организации
	|Документ.РасходСоСчета.Чтение.БанковскиеСчета
	|Документ.РасходСоСчета.Чтение.ГруппыКонтрагентов
	|Документ.РасходСоСчета.Чтение.Организации
	|Документ.РасходыПриИмпорте.Изменение.ГруппыКонтрагентов
	|Документ.РасходыПриИмпорте.Изменение.Организации
	|Документ.РасходыПриИмпорте.Изменение.Склады
	|Документ.РасходыПриИмпорте.Чтение.ГруппыКонтрагентов
	|Документ.РасходыПриИмпорте.Чтение.Организации
	|Документ.РасходыПриИмпорте.Чтение.Склады
	|Документ.РегламентированныйОтчет.Изменение.Организации
	|Документ.РегламентированныйОтчет.Чтение.Организации
	|Документ.РезервированиеЗапасов.Изменение.Организации
	|Документ.РезервированиеЗапасов.Чтение.Организации
	|Документ.СборкаЗапасов.Изменение.Организации
	|Документ.СборкаЗапасов.Изменение.Склады
	|Документ.СборкаЗапасов.Чтение.Организации
	|Документ.СборкаЗапасов.Чтение.Склады
	|Документ.СверкаВзаиморасчетов.Изменение.ГруппыКонтрагентов
	|Документ.СверкаВзаиморасчетов.Изменение.Организации
	|Документ.СверкаВзаиморасчетов.Чтение.ГруппыКонтрагентов
	|Документ.СверкаВзаиморасчетов.Чтение.Организации
	|Документ.СдельныйНаряд.Изменение.Организации
	|Документ.СдельныйНаряд.Чтение.Организации
	|Документ.Событие.Изменение.ГруппыКонтрагентов
	|Документ.Событие.Изменение.ГруппыЛидов
	|Документ.Событие.Изменение.УчетныеЗаписиЭлектроннойПочты
	|Документ.Событие.Чтение.ГруппыКонтрагентов
	|Документ.Событие.Чтение.ГруппыЛидов
	|Документ.Событие.Чтение.УчетныеЗаписиЭлектроннойПочты
	|Документ.СообщениеОбменСБанками.Чтение.Организации
	|Документ.СписаниеВА.Изменение.Организации
	|Документ.СписаниеВА.Чтение.Организации
	|Документ.СписаниеЗапасов.Изменение.Организации
	|Документ.СписаниеЗапасов.Изменение.Склады
	|Документ.СписаниеЗапасов.Чтение.Организации
	|Документ.СписаниеЗапасов.Чтение.Склады
	|Документ.СписаниеКодовМаркировкиИСМП.Изменение.Организации
	|Документ.СписаниеКодовМаркировкиИСМП.Чтение.Организации
	|Документ.СписаниеПартийЗЕРНО.Чтение.Организации
	|Документ.СписаниеПартийЗЕРНО.Изменение.Организации
	|Документ.СписаниеПроданныхПодарочныхСертификатов.Изменение.Организации
	|Документ.СписаниеПроданныхПодарочныхСертификатов.Чтение.Организации
	|Документ.СчетНаОплату.Изменение.ГруппыКонтрагентов
	|Документ.СчетНаОплату.Изменение.Организации
	|Документ.СчетНаОплату.Чтение.ГруппыКонтрагентов
	|Документ.СчетНаОплату.Чтение.Организации
	|Документ.СчетНаОплатуПоставщика.Изменение.ГруппыКонтрагентов
	|Документ.СчетНаОплатуПоставщика.Изменение.Организации
	|Документ.СчетНаОплатуПоставщика.Чтение.ГруппыКонтрагентов
	|Документ.СчетНаОплатуПоставщика.Чтение.Организации
	|Документ.СчетФактура.Изменение.ГруппыКонтрагентов
	|Документ.СчетФактура.Изменение.Организации
	|Документ.СчетФактура.Чтение.ГруппыКонтрагентов
	|Документ.СчетФактура.Чтение.Организации
	|Документ.СчетФактураПолученный.Изменение.ГруппыКонтрагентов
	|Документ.СчетФактураПолученный.Изменение.Организации
	|Документ.СчетФактураПолученный.Чтение.ГруппыКонтрагентов
	|Документ.СчетФактураПолученный.Чтение.Организации
	|Документ.Табель.Изменение.Организации
	|Документ.Табель.Чтение.Организации
	|Документ.ТТНВходящаяЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ТТНВходящаяЕГАИС.Изменение.Организации
	|Документ.ТТНВходящаяЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ТТНВходящаяЕГАИС.Чтение.Организации
	|Документ.ТТНВходящаяЕГАИС.Чтение.Склады
	|Документ.ТТНВходящаяЕГАИС.Изменение.Склады
	|Документ.ТТНИсходящаяЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ТТНИсходящаяЕГАИС.Изменение.Организации
	|Документ.ТТНИсходящаяЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ТТНИсходящаяЕГАИС.Чтение.Организации
	|Документ.ТранспортнаяНакладнаяЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ТранспортнаяНакладнаяЕГАИС.Чтение.Организации
	|Документ.ТранспортнаяНакладнаяЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ТранспортнаяНакладнаяЕГАИС.Изменение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.ГруппыКонтрагентов
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.ГруппыКонтрагентов
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Изменение.ГруппыКонтрагентов
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Изменение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.ГруппыКонтрагентов
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.Организации
	|Документ.УведомлениеОПолучателеДокументов.Изменение.Организации
	|Документ.УведомлениеОПолучателеДокументов.Чтение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.ГруппыКонтрагентов
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.ГруппыКонтрагентов
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОСпецрежимахНалогообложения.Изменение.Организации
	|Документ.УведомлениеОСпецрежимахНалогообложения.Чтение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Изменение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Чтение.Организации
	|Документ.УвольнениеУНФ.Изменение.Организации
	|Документ.УвольнениеУНФ.Чтение.Организации
	|Документ.УстановкаЦенНоменклатуры.Чтение.ВидыЦен
	|Документ.УстановкаЦенНоменклатуры.Изменение.ВидыЦен
	|Документ.УдалитьПроизвольныйЭД.Чтение.Организации
	|Документ.УточнениеСведенийОКодахМаркировкиИСМП.Изменение.Организации
	|Документ.УточнениеСведенийОКодахМаркировкиИСМП.Чтение.Организации
	|Документ.УчетВремени.Изменение.Организации
	|Документ.УчетВремени.Чтение.Организации
	|Документ.ФормированиеПартийЗЕРНО.Чтение.Организации
	|Документ.ФормированиеПартийЗЕРНО.Изменение.Организации
	|Документ.ФормированиеПартийИзДругихПартийЗЕРНО.Чтение.Организации
	|Документ.ФормированиеПартийИзДругихПартийЗЕРНО.Изменение.Организации
	|Документ.ФормированиеПартийПриПроизводствеЗЕРНО.Чтение.Организации
	|Документ.ФормированиеПартийПриПроизводствеЗЕРНО.Изменение.Организации
	|Документ.ЧекЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ЧекЕГАИС.Изменение.Организации
	|Документ.ЧекЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ЧекЕГАИС.Чтение.Организации
	|Документ.ЧекЕГАИСВозврат.Изменение.ГруппыКонтрагентов
	|Документ.ЧекЕГАИСВозврат.Изменение.Организации
	|Документ.ЧекЕГАИСВозврат.Чтение.ГруппыКонтрагентов
	|Документ.ЧекЕГАИСВозврат.Чтение.Организации
	|Документ.ЧекККМ.Изменение.ГруппыКонтрагентов
	|Документ.ЧекККМ.Изменение.КассыККМ
	|Документ.ЧекККМ.Изменение.Организации
	|Документ.ЧекККМ.Изменение.Склады
	|Документ.ЧекККМ.Чтение.ГруппыКонтрагентов
	|Документ.ЧекККМ.Чтение.КассыККМ
	|Документ.ЧекККМ.Чтение.Организации
	|Документ.ЧекККМ.Чтение.Склады
	|Документ.ЧекККМВозврат.Изменение.ГруппыКонтрагентов
	|Документ.ЧекККМВозврат.Изменение.КассыККМ
	|Документ.ЧекККМВозврат.Изменение.Организации
	|Документ.ЧекККМВозврат.Изменение.Склады
	|Документ.ЧекККМВозврат.Чтение.ГруппыКонтрагентов
	|Документ.ЧекККМВозврат.Чтение.КассыККМ
	|Документ.ЧекККМВозврат.Чтение.Организации
	|Документ.ЧекККМВозврат.Чтение.Склады
	|";
    #КонецУдаления
	
	#Вставка
	Результат =
	"Документ.АвансовыйОтчет.Изменение.ГруппыКонтрагентов
	|Документ.АвансовыйОтчет.Изменение.Организации
	|Документ.АвансовыйОтчет.Чтение.ГруппыКонтрагентов
	|Документ.АвансовыйОтчет.Чтение.Организации
	|Документ.АктВыполненныхРабот.Изменение.ГруппыКонтрагентов
	|Документ.АктВыполненныхРабот.Изменение.Организации
	|Документ.АктВыполненныхРабот.Чтение.ГруппыКонтрагентов
	|Документ.АктВыполненныхРабот.Чтение.Организации
	|Документ.АктОРасхождениях.Изменение.ГруппыКонтрагентов
	|Документ.АктОРасхождениях.Изменение.Организации
	|Документ.АктОРасхождениях.Изменение.СтруктурныеЕдиницы
	|Документ.АктОРасхождениях.Чтение.ГруппыКонтрагентов
	|Документ.АктОРасхождениях.Чтение.Организации
	|Документ.АктОРасхождениях.Чтение.СтруктурныеЕдиницы
	|Документ.АктОРасхожденияхПолученный.Изменение.ГруппыКонтрагентов
	|Документ.АктОРасхожденияхПолученный.Изменение.Организации
	|Документ.АктОРасхожденияхПолученный.Изменение.СтруктурныеЕдиницы
	|Документ.АктОРасхожденияхПолученный.Чтение.ГруппыКонтрагентов
	|Документ.АктОРасхожденияхПолученный.Чтение.Организации
	|Документ.АктОРасхожденияхПолученный.Чтение.СтруктурныеЕдиницы
	|Документ.АктПостановкиНаБалансЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.АктПостановкиНаБалансЕГАИС.Изменение.Организации
	|Документ.АктПостановкиНаБалансЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.АктПостановкиНаБалансЕГАИС.Чтение.Организации
	|Документ.АктСписанияЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.АктСписанияЕГАИС.Изменение.Организации
	|Документ.АктСписанияЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.АктСписанияЕГАИС.Чтение.Организации
	|Документ.АмортизацияВА.Изменение.Организации
	|Документ.АмортизацияВА.Чтение.Организации
	|Документ.ВводНачальныхОстатков.Чтение.Организации
	|Документ.Взаимозачет.Изменение.ГруппыКонтрагентов
	|Документ.Взаимозачет.Изменение.Организации
	|Документ.Взаимозачет.Чтение.ГруппыКонтрагентов
	|Документ.Взаимозачет.Чтение.Организации
	|Документ.ВнесениеНаличных.Изменение.КассыККМ
	|Документ.ВнесениеНаличных.Изменение.Организации
	|Документ.ВнесениеНаличных.Чтение.КассыККМ
	|Документ.ВнесениеНаличных.Чтение.Организации
	|Документ.ВнесениеСведенийОСобранномУрожаеЗЕРНО.Чтение.Организации
	|Документ.ВнесениеСведенийОСобранномУрожаеЗЕРНО.Изменение.Организации
	|Документ.ВозвратВОборотИСМП.Чтение.Организации
	|Документ.ВозвратВОборотИСМП.Изменение.Организации
	|Документ.ВозвратИзРегистра2ЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ВозвратИзРегистра2ЕГАИС.Изменение.Организации
	|Документ.ВозвратИзРегистра2ЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ВозвратИзРегистра2ЕГАИС.Чтение.Организации
	|Документ.ВыводИзОборотаИСМП.Изменение.Организации
	|Документ.ВыводИзОборотаИСМП.Чтение.Организации
	|Документ.ВыгрузкаРегламентированныхОтчетов.Изменение.Организации
	|Документ.ВыгрузкаРегламентированныхОтчетов.Чтение.Организации
	|Документ.ВыемкаНаличных.Изменение.КассыККМ
	|Документ.ВыемкаНаличных.Изменение.Организации
	|Документ.ВыемкаНаличных.Чтение.КассыККМ
	|Документ.ВыемкаНаличных.Чтение.Организации
	|Документ.ВыработкаВА.Изменение.Организации
	|Документ.ВыработкаВА.Чтение.Организации
	|Документ.Доверенность.Изменение.ГруппыКонтрагентов
	|Документ.Доверенность.Изменение.Организации
	|Документ.Доверенность.Чтение.ГруппыКонтрагентов
	|Документ.Доверенность.Чтение.Организации
	|Документ.ДоговорКредитаИЗайма.Чтение.ВидыДоговоровКредитаИЗайма
	|Документ.ДоговорКредитаИЗайма.Чтение.ГруппыКонтрагентов
	|Документ.ДоговорКредитаИЗайма.Чтение.Организации
	|Документ.ДоговорКредитаИЗайма.Изменение.ВидыДоговоровКредитаИЗайма
	|Документ.ДоговорКредитаИЗайма.Изменение.ГруппыКонтрагентов
	|Документ.ДоговорКредитаИЗайма.Изменение.Организации
	|Документ.ДополнительныеРасходы.Изменение.ГруппыКонтрагентов
	|Документ.ДополнительныеРасходы.Изменение.Организации
	|Документ.ДополнительныеРасходы.Изменение.СтруктурныеЕдиницы
	|Документ.ДополнительныеРасходы.Чтение.ГруппыКонтрагентов
	|Документ.ДополнительныеРасходы.Чтение.Организации
	|Документ.ДополнительныеРасходы.Чтение.СтруктурныеЕдиницы
	|Документ.ЗаданиеНаРаботу.Изменение.Организации
	|Документ.ЗаданиеНаРаботу.Чтение.Организации
	|Документ.ЗаказНаПеремещение.Изменение.Организации
	|Документ.ЗаказНаПеремещение.Изменение.СтруктурныеЕдиницы
	|Документ.ЗаказНаПеремещение.Чтение.Организации
	|Документ.ЗаказНаПеремещение.Чтение.СтруктурныеЕдиницы
	|Документ.ЗаказНаПроизводство.Изменение.ГруппыКонтрагентов
	|Документ.ЗаказНаПроизводство.Изменение.Организации
	|Документ.ЗаказНаПроизводство.Чтение.ГруппыКонтрагентов
	|Документ.ЗаказНаПроизводство.Чтение.Организации
	|Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Изменение.Организации
	|Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Чтение.Организации
	|Документ.ЗаказПокупателя.Изменение.ГруппыКонтрагентов
	|Документ.ЗаказПокупателя.Изменение.Организации
	|Документ.ЗаказПокупателя.Чтение.ГруппыКонтрагентов
	|Документ.ЗаказПокупателя.Чтение.Организации
	|Документ.ЗаказПоставщику.Изменение.ГруппыКонтрагентов
	|Документ.ЗаказПоставщику.Изменение.Организации
	|Документ.ЗаказПоставщику.Чтение.ГруппыКонтрагентов
	|Документ.ЗаказПоставщику.Чтение.Организации
	|Документ.ЗакрытиеМесяца.Чтение.Организации
	|Документ.ЗакрытиеМесяца.Изменение.Организации
	|Документ.ЗапросАкцизныхМарокЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ЗапросАкцизныхМарокЕГАИС.Изменение.Организации
	|Документ.ЗапросАкцизныхМарокЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ЗапросАкцизныхМарокЕГАИС.Чтение.Организации
	|Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Изменение.Организации
	|Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Чтение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.Изменение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.Чтение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя.Изменение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя.Чтение.Организации
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Изменение.ГруппыКонтрагентов
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Изменение.Организации
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Чтение.ГруппыКонтрагентов
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Чтение.Организации
	|Документ.ЗапросОстатковПартийЗЕРНО.Чтение.Организации
	|Документ.ЗапросОстатковПартийЗЕРНО.Изменение.Организации
	|Документ.ЗаявлениеАбонентаСпецоператораСвязи.Изменение.Организации
	|Документ.ЗаявлениеАбонентаСпецоператораСвязи.Чтение.Организации
	|Документ.ИзменениеПараметровВА.Изменение.Организации
	|Документ.ИзменениеПараметровВА.Чтение.Организации
	|Документ.ИнвентаризацияЗапасов.Изменение.Организации
	|Документ.ИнвентаризацияЗапасов.Изменение.СтруктурныеЕдиницы
	|Документ.ИнвентаризацияЗапасов.Чтение.Организации
	|Документ.ИнвентаризацияЗапасов.Чтение.СтруктурныеЕдиницы
	|Документ.КадровоеПеремещениеУНФ.Изменение.Организации
	|Документ.КадровоеПеремещениеУНФ.Чтение.Организации
	|Документ.КассоваяКнига.Изменение.Кассы
	|Документ.КассоваяКнига.Изменение.Организации
	|Документ.КассоваяКнига.Чтение.Кассы
	|Документ.КассоваяКнига.Чтение.Организации
	|Документ.КомплектацияЗапасов.Изменение.Организации
	|Документ.КомплектацияЗапасов.Изменение.СтруктурныеЕдиницы
	|Документ.КомплектацияЗапасов.Чтение.Организации
	|Документ.КомплектацияЗапасов.Чтение.Склады
	|Документ.КорректировкаПоступления.Изменение.ГруппыКонтрагентов
	|Документ.КорректировкаПоступления.Изменение.Организации
	|Документ.КорректировкаПоступления.Изменение.СтруктурныеЕдиницы
	|Документ.КорректировкаПоступления.Чтение.ГруппыКонтрагентов
	|Документ.КорректировкаПоступления.Чтение.Организации
	|Документ.КорректировкаПоступления.Чтение.СтруктурныеЕдиницы
	|Документ.КорректировкаРеализации.Изменение.ГруппыКонтрагентов
	|Документ.КорректировкаРеализации.Изменение.Организации
	|Документ.КорректировкаРеализации.Изменение.СтруктурныеЕдиницы
	|Документ.КорректировкаРеализации.Чтение.ГруппыКонтрагентов
	|Документ.КорректировкаРеализации.Чтение.Организации
	|Документ.КорректировкаРеализации.Чтение.СтруктурныеЕдиницы
	|Документ.МаркировкаТоваровГИСМ.Изменение.Организации
	|Документ.МаркировкаТоваровГИСМ.Чтение.Организации
	|Документ.МаркировкаТоваровГИСМ.Чтение.СтруктурныеЕдиницы
	|Документ.МаркировкаТоваровГИСМ.Изменение.СтруктурныеЕдиницы
	|Документ.МаркировкаТоваровИСМП.Изменение.Организации
	|Документ.МаркировкаТоваровИСМП.Чтение.Организации
	|Документ.МаршрутныйЛист.Изменение.Организации
	|Документ.МаршрутныйЛист.Чтение.Организации
	|Документ.МассоваяРассылка.Изменение.ГруппыКонтрагентов
	|Документ.МассоваяРассылка.Чтение.ГруппыКонтрагентов
	|Документ.НачислениеЗарплатыУНФ.Изменение.Организации
	|Документ.НачислениеЗарплатыУНФ.Чтение.Организации
	|Документ.НачислениеНалогов.Изменение.Организации
	|Документ.НачислениеНалогов.Чтение.Организации
	|Документ.НачисленияПоКредитамИЗаймам.Изменение.ГруппыКонтрагентов
	|Документ.НачисленияПоКредитамИЗаймам.Изменение.Организации
	|Документ.НачисленияПоКредитамИЗаймам.Чтение.ГруппыКонтрагентов
	|Документ.НачисленияПоКредитамИЗаймам.Чтение.Организации
	|Документ.ОперацияПоПлатежнымКартам.Изменение.БанковскиеСчета
	|Документ.ОперацияПоПлатежнымКартам.Изменение.ГруппыКонтрагентов
	|Документ.ОперацияПоПлатежнымКартам.Изменение.Организации
	|Документ.ОперацияПоПлатежнымКартам.Чтение.БанковскиеСчета
	|Документ.ОперацияПоПлатежнымКартам.Чтение.ГруппыКонтрагентов
	|Документ.ОперацияПоПлатежнымКартам.Чтение.Организации
	|Документ.ОприходованиеЗапасов.Изменение.Организации
	|Документ.ОприходованиеЗапасов.Изменение.СтруктурныеЕдиницы
	|Документ.ОприходованиеЗапасов.Чтение.Организации
	|Документ.ОприходованиеЗапасов.Чтение.СтруктурныеЕдиницы
	|Документ.ОстаткиЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ОстаткиЕГАИС.Изменение.Организации
	|Документ.ОстаткиЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ОстаткиЕГАИС.Чтение.Организации
	|Документ.ОтгрузкаТоваровИСМП.Изменение.Организации
	|Документ.ОтгрузкаТоваровИСМП.Чтение.Организации
	|Документ.ОтчетЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ОтчетЕГАИС.Изменение.Организации
	|Документ.ОтчетЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ОтчетЕГАИС.Чтение.Организации
	|Документ.ОтчетКомиссионера.Изменение.ГруппыКонтрагентов
	|Документ.ОтчетКомиссионера.Изменение.Организации
	|Документ.ОтчетКомиссионера.Чтение.ГруппыКонтрагентов
	|Документ.ОтчетКомиссионера.Чтение.Организации
	|Документ.ОтчетКомиссионераОСписании.Изменение.ГруппыКонтрагентов
	|Документ.ОтчетКомиссионераОСписании.Изменение.Организации
	|Документ.ОтчетКомиссионераОСписании.Чтение.ГруппыКонтрагентов
	|Документ.ОтчетКомиссионераОСписании.Чтение.Организации
	|Документ.ОтчетКомитенту.Изменение.ГруппыКонтрагентов
	|Документ.ОтчетКомитенту.Изменение.Организации
	|Документ.ОтчетКомитенту.Чтение.ГруппыКонтрагентов
	|Документ.ОтчетКомитенту.Чтение.Организации
	|Документ.ОтчетОПереработке.Изменение.ГруппыКонтрагентов
	|Документ.ОтчетОПереработке.Изменение.Организации
	|Документ.ОтчетОПереработке.Изменение.СтруктурныеЕдиницы
	|Документ.ОтчетОПереработке.Чтение.ГруппыКонтрагентов
	|Документ.ОтчетОПереработке.Чтение.Организации
	|Документ.ОтчетОПереработке.Чтение.СтруктурныеЕдиницы
	|Документ.ОтчетОРозничныхПродажах.Изменение.КассыККМ
	|Документ.ОтчетОРозничныхПродажах.Изменение.Организации
	|Документ.ОтчетОРозничныхПродажах.Изменение.СтруктурныеЕдиницы
	|Документ.ОтчетОРозничныхПродажах.Чтение.КассыККМ
	|Документ.ОтчетОРозничныхПродажах.Чтение.Организации
	|Документ.ОтчетОРозничныхПродажах.Чтение.СтруктурныеЕдиницы
	|Документ.ОтчетПереработчика.Изменение.ГруппыКонтрагентов
	|Документ.ОтчетПереработчика.Изменение.Организации
	|Документ.ОтчетПереработчика.Чтение.ГруппыКонтрагентов
	|Документ.ОтчетПереработчика.Чтение.Организации
	|Документ.ОформлениеСДИЗЗЕРНО.Изменение.Организации
	|Документ.ОформлениеСДИЗЗЕРНО.Чтение.Организации
	|Документ.ПакетОбменСБанками.Чтение.Организации
	|Документ.ПередачаВА.Изменение.ГруппыКонтрагентов
	|Документ.ПередачаВА.Изменение.Организации
	|Документ.ПередачаВА.Чтение.ГруппыКонтрагентов
	|Документ.ПередачаВА.Чтение.Организации
	|Документ.ПередачаВРегистр2ЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ПередачаВРегистр2ЕГАИС.Изменение.Организации
	|Документ.ПередачаВРегистр2ЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ПередачаВРегистр2ЕГАИС.Чтение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.ГруппыКонтрагентов
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.СтруктурныеЕдиницы
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.ГруппыКонтрагентов
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.СтруктурныеЕдиницы
	|Документ.ПеремаркировкаТоваровГИСМ.Изменение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Чтение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Чтение.СтруктурныеЕдиницы
	|Документ.ПеремаркировкаТоваровГИСМ.Изменение.СтруктурныеЕдиницы
	|Документ.ПеремаркировкаТоваровИСМП.Изменение.Организации
	|Документ.ПеремаркировкаТоваровИСМП.Чтение.Организации
	|Документ.ПеремещениеДС.Изменение.Кассы
	|Документ.ПеремещениеДС.Изменение.Организации
	|Документ.ПеремещениеДС.Чтение.Кассы
	|Документ.ПеремещениеДС.Чтение.Организации
	|Документ.ПеремещениеДСПлан.Изменение.Кассы
	|Документ.ПеремещениеДСПлан.Изменение.Организации
	|Документ.ПеремещениеДСПлан.Чтение.Кассы
	|Документ.ПеремещениеДСПлан.Чтение.Организации
	|Документ.ПеремещениеЗапасов.Изменение.Организации
	|Документ.ПеремещениеЗапасов.Изменение.СтруктурныеЕдиницы
	|Документ.ПеремещениеЗапасов.Чтение.Организации
	|Документ.ПеремещениеЗапасов.Чтение.СтруктурныеЕдиницы
	|Документ.ПеремещениеПоЯчейкам.Изменение.Организации
	|Документ.ПеремещениеПоЯчейкам.Изменение.СтруктурныеЕдиницы
	|Документ.ПеремещениеПоЯчейкам.Чтение.Организации
	|Документ.ПеремещениеПоЯчейкам.Чтение.СтруктурныеЕдиницы
	|Документ.ПереоценкаВРозницеСуммовойУчет.Изменение.Организации
	|Документ.ПереоценкаВРозницеСуммовойУчет.Чтение.Организации
	|Документ.ПереоценкаТоваровНаКомиссии.Изменение.ГруппыКонтрагентов
	|Документ.ПереоценкаТоваровНаКомиссии.Изменение.Организации
	|Документ.ПереоценкаТоваровНаКомиссии.Чтение.ГруппыКонтрагентов
	|Документ.ПереоценкаТоваровНаКомиссии.Чтение.Организации
	|Документ.ПересортицаЗапасов.Изменение.Организации
	|Документ.ПересортицаЗапасов.Изменение.СтруктурныеЕдиницы
	|Документ.ПересортицаЗапасов.Чтение.Организации
	|Документ.ПересортицаЗапасов.Чтение.СтруктурныеЕдиницы
	|Документ.ПланПродаж.Изменение.Организации
	|Документ.ПланПродаж.Чтение.Организации
	|Документ.ПлатежнаяВедомость.Изменение.Организации
	|Документ.ПлатежнаяВедомость.Чтение.Организации
	|Документ.ПлатежноеПоручение.Изменение.БанковскиеСчета
	|Документ.ПлатежноеПоручение.Изменение.ГруппыКонтрагентов
	|Документ.ПлатежноеПоручение.Изменение.Организации
	|Документ.ПлатежноеПоручение.Чтение.БанковскиеСчета
	|Документ.ПлатежноеПоручение.Чтение.ГруппыКонтрагентов
	|Документ.ПлатежноеПоручение.Чтение.Организации
	|Документ.ПоказателиЕНВД.Изменение.Организации
	|Документ.ПоказателиЕНВД.Чтение.Организации
	|Документ.ПогашениеСДИЗЗЕРНО.Чтение.Организации
	|Документ.ПогашениеСДИЗЗЕРНО.Изменение.Организации
	|Документ.ПоступлениеВКассу.Изменение.БанковскиеСчета
	|Документ.ПоступлениеВКассу.Изменение.ГруппыКонтрагентов
	|Документ.ПоступлениеВКассу.Изменение.Кассы
	|Документ.ПоступлениеВКассу.Изменение.КассыККМ
	|Документ.ПоступлениеВКассу.Изменение.Организации
	|Документ.ПоступлениеВКассу.Чтение.БанковскиеСчета
	|Документ.ПоступлениеВКассу.Чтение.ГруппыКонтрагентов
	|Документ.ПоступлениеВКассу.Чтение.Кассы
	|Документ.ПоступлениеВКассу.Чтение.КассыККМ
	|Документ.ПоступлениеВКассу.Чтение.Организации
	|Документ.ПоступлениеДСПлан.Изменение.ГруппыКонтрагентов
	|Документ.ПоступлениеДСПлан.Изменение.Организации
	|Документ.ПоступлениеДСПлан.Чтение.ГруппыКонтрагентов
	|Документ.ПоступлениеДСПлан.Чтение.Организации
	|Документ.ПоступлениеНаСчет.Изменение.БанковскиеСчета
	|Документ.ПоступлениеНаСчет.Изменение.ГруппыКонтрагентов
	|Документ.ПоступлениеНаСчет.Изменение.Организации
	|Документ.ПоступлениеНаСчет.Чтение.БанковскиеСчета
	|Документ.ПоступлениеНаСчет.Чтение.ГруппыКонтрагентов
	|Документ.ПоступлениеНаСчет.Чтение.Организации
	|Документ.ПоложениеОПремировании.Изменение.Организации
	|Документ.ПоложениеОПремировании.Чтение.Организации
	|Документ.ПоясненияКДекларацииПоНДС.Изменение.Организации
	|Документ.ПоясненияКДекларацииПоНДС.Чтение.Организации
	|Документ.ПриемкаТоваровИСМП.Чтение.Организации
	|Документ.ПриемкаТоваровИСМП.Изменение.Организации
	|Документ.ПриемИПередачаВРемонт.Изменение.ГруппыКонтрагентов
	|Документ.ПриемИПередачаВРемонт.Изменение.Организации
	|Документ.ПриемИПередачаВРемонт.Изменение.СтруктурныеЕдиницы
	|Документ.ПриемИПередачаВРемонт.Чтение.ГруппыКонтрагентов
	|Документ.ПриемИПередачаВРемонт.Чтение.Организации
	|Документ.ПриемИПередачаВРемонт.Чтение.СтруктурныеЕдиницы
	|Документ.ПриемНаРаботуУНФ.Изменение.Организации
	|Документ.ПриемНаРаботуУНФ.Чтение.Организации
	|Документ.ПринятиеКУчетуВА.Изменение.Организации
	|Документ.ПринятиеКУчетуВА.Изменение.СтруктурныеЕдиницы
	|Документ.ПринятиеКУчетуВА.Чтение.Организации
	|Документ.ПринятиеКУчетуВА.Чтение.СтруктурныеЕдиницы
	|Документ.ПриходнаяНакладная.Изменение.ГруппыКонтрагентов
	|Документ.ПриходнаяНакладная.Изменение.Организации
	|Документ.ПриходнаяНакладная.Изменение.СтруктурныеЕдиницы
	|Документ.ПриходнаяНакладная.Чтение.ГруппыКонтрагентов
	|Документ.ПриходнаяНакладная.Чтение.Организации
	|Документ.ПриходнаяНакладная.Чтение.СтруктурныеЕдиницы
	|Документ.ПриходныйОрдер.Изменение.Организации
	|Документ.ПриходныйОрдер.Изменение.СтруктурныеЕдиницы
	|Документ.ПриходныйОрдер.Чтение.Организации
	|Документ.ПриходныйОрдер.Чтение.СтруктурныеЕдиницы
	|Документ.ПрочиеРасходы.Чтение.ГруппыКонтрагентов
	|Документ.ПрочиеРасходы.Чтение.Организации
	|Документ.РаспределениеЗатрат.Изменение.Организации
	|Документ.РаспределениеЗатрат.Чтение.Организации
	|Документ.РасходДСПлан.Изменение.ГруппыКонтрагентов
	|Документ.РасходДСПлан.Изменение.Организации
	|Документ.РасходДСПлан.Чтение.ГруппыКонтрагентов
	|Документ.РасходДСПлан.Чтение.Организации
	|Документ.РасходИзКассы.Изменение.БанковскиеСчета
	|Документ.РасходИзКассы.Изменение.ГруппыКонтрагентов
	|Документ.РасходИзКассы.Изменение.Кассы
	|Документ.РасходИзКассы.Изменение.КассыККМ
	|Документ.РасходИзКассы.Изменение.Организации
	|Документ.РасходИзКассы.Чтение.БанковскиеСчета
	|Документ.РасходИзКассы.Чтение.ГруппыКонтрагентов
	|Документ.РасходИзКассы.Чтение.Кассы
	|Документ.РасходИзКассы.Чтение.КассыККМ
	|Документ.РасходИзКассы.Чтение.Организации
	|Документ.РасходнаяНакладная.Изменение.ГруппыКонтрагентов
	|Документ.РасходнаяНакладная.Изменение.Организации
	|Документ.РасходнаяНакладная.Изменение.СтруктурныеЕдиницы
	|Документ.РасходнаяНакладная.Чтение.ГруппыКонтрагентов
	|Документ.РасходнаяНакладная.Чтение.Организации
	|Документ.РасходнаяНакладная.Чтение.СтруктурныеЕдиницы
	|Документ.РасходныйОрдер.Изменение.Организации
	|Документ.РасходныйОрдер.Изменение.СтруктурныеЕдиницы
	|Документ.РасходныйОрдер.Чтение.Организации
	|Документ.РасходныйОрдер.Чтение.СтруктурныеЕдиницы
	|Документ.РасходСоСчета.Изменение.БанковскиеСчета
	|Документ.РасходСоСчета.Изменение.ГруппыКонтрагентов
	|Документ.РасходСоСчета.Изменение.Организации
	|Документ.РасходСоСчета.Чтение.БанковскиеСчета
	|Документ.РасходСоСчета.Чтение.ГруппыКонтрагентов
	|Документ.РасходСоСчета.Чтение.Организации
	|Документ.РасходыПриИмпорте.Изменение.ГруппыКонтрагентов
	|Документ.РасходыПриИмпорте.Изменение.Организации
	|Документ.РасходыПриИмпорте.Изменение.СтруктурныеЕдиницы
	|Документ.РасходыПриИмпорте.Чтение.ГруппыКонтрагентов
	|Документ.РасходыПриИмпорте.Чтение.Организации
	|Документ.РасходыПриИмпорте.Чтение.СтруктурныеЕдиницы
	|Документ.РегламентированныйОтчет.Изменение.Организации
	|Документ.РегламентированныйОтчет.Чтение.Организации
	|Документ.РезервированиеЗапасов.Изменение.Организации
	|Документ.РезервированиеЗапасов.Чтение.Организации
	|Документ.СборкаЗапасов.Изменение.Организации
	|Документ.СборкаЗапасов.Изменение.СтруктурныеЕдиницы
	|Документ.СборкаЗапасов.Чтение.Организации
	|Документ.СборкаЗапасов.Чтение.СтруктурныеЕдиницы
	|Документ.СверкаВзаиморасчетов.Изменение.ГруппыКонтрагентов
	|Документ.СверкаВзаиморасчетов.Изменение.Организации
	|Документ.СверкаВзаиморасчетов.Чтение.ГруппыКонтрагентов
	|Документ.СверкаВзаиморасчетов.Чтение.Организации
	|Документ.СдельныйНаряд.Изменение.Организации
	|Документ.СдельныйНаряд.Чтение.Организации
	|Документ.Событие.Изменение.ГруппыКонтрагентов
	|Документ.Событие.Изменение.ГруппыЛидов
	|Документ.Событие.Изменение.УчетныеЗаписиЭлектроннойПочты
	|Документ.Событие.Чтение.ГруппыКонтрагентов
	|Документ.Событие.Чтение.ГруппыЛидов
	|Документ.Событие.Чтение.УчетныеЗаписиЭлектроннойПочты
	|Документ.СообщениеОбменСБанками.Чтение.Организации
	|Документ.СписаниеВА.Изменение.Организации
	|Документ.СписаниеВА.Чтение.Организации
	|Документ.СписаниеЗапасов.Изменение.Организации
	|Документ.СписаниеЗапасов.Изменение.СтруктурныеЕдиницы
	|Документ.СписаниеЗапасов.Чтение.Организации
	|Документ.СписаниеЗапасов.Чтение.СтруктурныеЕдиницы
	|Документ.СписаниеКодовМаркировкиИСМП.Изменение.Организации
	|Документ.СписаниеКодовМаркировкиИСМП.Чтение.Организации
	|Документ.СписаниеПартийЗЕРНО.Чтение.Организации
	|Документ.СписаниеПартийЗЕРНО.Изменение.Организации
	|Документ.СписаниеПроданныхПодарочныхСертификатов.Изменение.Организации
	|Документ.СписаниеПроданныхПодарочныхСертификатов.Чтение.Организации
	|Документ.СчетНаОплату.Изменение.ГруппыКонтрагентов
	|Документ.СчетНаОплату.Изменение.Организации
	|Документ.СчетНаОплату.Чтение.ГруппыКонтрагентов
	|Документ.СчетНаОплату.Чтение.Организации
	|Документ.СчетНаОплатуПоставщика.Изменение.ГруппыКонтрагентов
	|Документ.СчетНаОплатуПоставщика.Изменение.Организации
	|Документ.СчетНаОплатуПоставщика.Чтение.ГруппыКонтрагентов
	|Документ.СчетНаОплатуПоставщика.Чтение.Организации
	|Документ.СчетФактура.Изменение.ГруппыКонтрагентов
	|Документ.СчетФактура.Изменение.Организации
	|Документ.СчетФактура.Чтение.ГруппыКонтрагентов
	|Документ.СчетФактура.Чтение.Организации
	|Документ.СчетФактураПолученный.Изменение.ГруппыКонтрагентов
	|Документ.СчетФактураПолученный.Изменение.Организации
	|Документ.СчетФактураПолученный.Чтение.ГруппыКонтрагентов
	|Документ.СчетФактураПолученный.Чтение.Организации
	|Документ.Табель.Изменение.Организации
	|Документ.Табель.Чтение.Организации
	|Документ.ТТНВходящаяЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ТТНВходящаяЕГАИС.Изменение.Организации
	|Документ.ТТНВходящаяЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ТТНВходящаяЕГАИС.Чтение.Организации
	|Документ.ТТНВходящаяЕГАИС.Чтение.СтруктурныеЕдиницы
	|Документ.ТТНВходящаяЕГАИС.Изменение.СтруктурныеЕдиницы
	|Документ.ТТНИсходящаяЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ТТНИсходящаяЕГАИС.Изменение.Организации
	|Документ.ТТНИсходящаяЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ТТНИсходящаяЕГАИС.Чтение.Организации
	|Документ.ТранспортнаяНакладнаяЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ТранспортнаяНакладнаяЕГАИС.Чтение.Организации
	|Документ.ТранспортнаяНакладнаяЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ТранспортнаяНакладнаяЕГАИС.Изменение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.ГруппыКонтрагентов
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.ГруппыКонтрагентов
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Изменение.ГруппыКонтрагентов
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Изменение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.ГруппыКонтрагентов
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.Организации
	|Документ.УведомлениеОПолучателеДокументов.Изменение.Организации
	|Документ.УведомлениеОПолучателеДокументов.Чтение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.ГруппыКонтрагентов
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.ГруппыКонтрагентов
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОСпецрежимахНалогообложения.Изменение.Организации
	|Документ.УведомлениеОСпецрежимахНалогообложения.Чтение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Изменение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Чтение.Организации
	|Документ.УвольнениеУНФ.Изменение.Организации
	|Документ.УвольнениеУНФ.Чтение.Организации
	|Документ.УстановкаЦенНоменклатуры.Чтение.ВидыЦен
	|Документ.УстановкаЦенНоменклатуры.Изменение.ВидыЦен
	|Документ.УдалитьПроизвольныйЭД.Чтение.Организации
	|Документ.УточнениеСведенийОКодахМаркировкиИСМП.Изменение.Организации
	|Документ.УточнениеСведенийОКодахМаркировкиИСМП.Чтение.Организации
	|Документ.УчетВремени.Изменение.Организации
	|Документ.УчетВремени.Чтение.Организации
	|Документ.ФормированиеПартийЗЕРНО.Чтение.Организации
	|Документ.ФормированиеПартийЗЕРНО.Изменение.Организации
	|Документ.ФормированиеПартийИзДругихПартийЗЕРНО.Чтение.Организации
	|Документ.ФормированиеПартийИзДругихПартийЗЕРНО.Изменение.Организации
	|Документ.ФормированиеПартийПриПроизводствеЗЕРНО.Чтение.Организации
	|Документ.ФормированиеПартийПриПроизводствеЗЕРНО.Изменение.Организации
	|Документ.ЧекЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ЧекЕГАИС.Изменение.Организации
	|Документ.ЧекЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ЧекЕГАИС.Чтение.Организации
	|Документ.ЧекЕГАИСВозврат.Изменение.ГруппыКонтрагентов
	|Документ.ЧекЕГАИСВозврат.Изменение.Организации
	|Документ.ЧекЕГАИСВозврат.Чтение.ГруппыКонтрагентов
	|Документ.ЧекЕГАИСВозврат.Чтение.Организации
	|Документ.ЧекККМ.Изменение.ГруппыКонтрагентов
	|Документ.ЧекККМ.Изменение.КассыККМ
	|Документ.ЧекККМ.Изменение.Организации
	|Документ.ЧекККМ.Изменение.СтруктурныеЕдиницы
	|Документ.ЧекККМ.Чтение.ГруппыКонтрагентов
	|Документ.ЧекККМ.Чтение.КассыККМ
	|Документ.ЧекККМ.Чтение.Организации
	|Документ.ЧекККМ.Чтение.СтруктурныеЕдиницы
	|Документ.ЧекККМВозврат.Изменение.ГруппыКонтрагентов
	|Документ.ЧекККМВозврат.Изменение.КассыККМ
	|Документ.ЧекККМВозврат.Изменение.Организации
	|Документ.ЧекККМВозврат.Изменение.СтруктурныеЕдиницы
	|Документ.ЧекККМВозврат.Чтение.ГруппыКонтрагентов
	|Документ.ЧекККМВозврат.Чтение.КассыККМ
	|Документ.ЧекККМВозврат.Чтение.Организации
	|Документ.ЧекККМВозврат.Чтение.СтруктурныеЕдиницы
	|Документ.Пр_ОтчетЗаДень.Чтение.СтруктурныеЕдиницы
	|Документ.Пр_ОтчетЗаДень.Изменение.СтруктурныеЕдиницы 
	|Документ.Пр_ОтчетЗаДень.Чтение.Сотрудники
	|Документ.Пр_ОтчетЗаДень.Изменение.Сотрудники
	|";
	#КонецВставки
	Возврат Результат;

КонецФункции

&ИзменениеИКонтроль("ВидыОграниченийПравЖурналов")
Функция Пр_ВидыОграниченийПравЖурналов()
	
	#Удаление
	Результат =
	"ЖурналДокументов.ДокументыПланированияДенег.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПланированияДенег.Чтение.Организации
	|ЖурналДокументов.ДокументыПланированияРесурсов.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПланированияРесурсов.Чтение.Организации
	|ЖурналДокументов.ДокументыПоБанку.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПоБанку.Чтение.Организации
	|ЖурналДокументов.ДокументыПоБанкуИКассе.Чтение.Кассы
	|ЖурналДокументов.ДокументыПоБанкуИКассе.Чтение.Организации
	|ЖурналДокументов.ДокументыПоЗакупкам.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПоЗакупкам.Чтение.Организации
	|ЖурналДокументов.ДокументыПоЗакупкам.Чтение.Склады
	|ЖурналДокументов.ДокументыПоЗапасам.Чтение.Организации
	|ЖурналДокументов.ДокументыПоЗапасам.Чтение.Склады
	|ЖурналДокументов.ДокументыПоЗарплате.Чтение.Организации
	|ЖурналДокументов.ДокументыПоКадрам.Чтение.Организации
	|ЖурналДокументов.ДокументыПоКассе.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПоКассе.Чтение.Кассы
	|ЖурналДокументов.ДокументыПоКассе.Чтение.Организации
	|ЖурналДокументов.ДокументыПоПродажам.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПоПродажам.Чтение.Организации
	|ЖурналДокументов.ДокументыПоПродажам.Чтение.Склады
	|ЖурналДокументов.ДокументыПоПроизводству.Чтение.Организации
	|ЖурналДокументов.ДокументыПоПроизводству.Чтение.Склады
	|ЖурналДокументов.ДокументыПоСкладу.Чтение.Организации
	|ЖурналДокументов.ДокументыПоСкладу.Чтение.Склады
	|ЖурналДокументов.ДокументыПоступленияДенег.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПоступленияДенег.Чтение.Кассы
	|ЖурналДокументов.ДокументыПоступленияДенег.Чтение.Организации
	|ЖурналДокументов.ДокументыПоУчетуВремени.Чтение.Организации
	|ЖурналДокументов.ДокументыРасходаДенег.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыРасходаДенег.Чтение.Кассы
	|ЖурналДокументов.ДокументыРасходаДенег.Чтение.Организации
	|ЖурналДокументов.КомиссионнаяТорговля.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.КомиссионнаяТорговля.Чтение.Организации
	|ЖурналДокументов.КомиссионнаяТорговля.Чтение.Склады
	|ЖурналДокументов.РозничныеПродажи.Чтение.Организации
	|ЖурналДокументов.СкладскиеАкты.Чтение.Организации
	|ЖурналДокументов.СкладскиеАкты.Чтение.Склады
	|ЖурналДокументов.СкладскиеОрдера.Чтение.Организации
	|ЖурналДокументов.СкладскиеОрдера.Чтение.Склады
	|ЖурналДокументов.ЧекиККМ.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ЧекиККМ.Чтение.Организации
	|ЖурналДокументов.ЧекиККМ.Чтение.Склады
	|";
    #КонецУдаления
	
	#Вставка
	Результат =
	"ЖурналДокументов.ДокументыПланированияДенег.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПланированияДенег.Чтение.Организации
	|ЖурналДокументов.ДокументыПланированияРесурсов.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПланированияРесурсов.Чтение.Организации
	|ЖурналДокументов.ДокументыПоБанку.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПоБанку.Чтение.Организации
	|ЖурналДокументов.ДокументыПоБанкуИКассе.Чтение.Кассы
	|ЖурналДокументов.ДокументыПоБанкуИКассе.Чтение.Организации
	|ЖурналДокументов.ДокументыПоЗакупкам.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПоЗакупкам.Чтение.Организации
	|ЖурналДокументов.ДокументыПоЗакупкам.Чтение.СтруктурныеЕдиницы
	|ЖурналДокументов.ДокументыПоЗапасам.Чтение.Организации
	|ЖурналДокументов.ДокументыПоЗапасам.Чтение.СтруктурныеЕдиницы
	|ЖурналДокументов.ДокументыПоЗарплате.Чтение.Организации
	|ЖурналДокументов.ДокументыПоКадрам.Чтение.Организации
	|ЖурналДокументов.ДокументыПоКассе.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПоКассе.Чтение.Кассы
	|ЖурналДокументов.ДокументыПоКассе.Чтение.Организации
	|ЖурналДокументов.ДокументыПоПродажам.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПоПродажам.Чтение.Организации
	|ЖурналДокументов.ДокументыПоПродажам.Чтение.СтруктурныеЕдиницы
	|ЖурналДокументов.ДокументыПоПроизводству.Чтение.Организации
	|ЖурналДокументов.ДокументыПоПроизводству.Чтение.СтруктурныеЕдиницы
	|ЖурналДокументов.ДокументыПоСкладу.Чтение.Организации
	|ЖурналДокументов.ДокументыПоСкладу.Чтение.СтруктурныеЕдиницы
	|ЖурналДокументов.ДокументыПоступленияДенег.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПоступленияДенег.Чтение.Кассы
	|ЖурналДокументов.ДокументыПоступленияДенег.Чтение.Организации
	|ЖурналДокументов.ДокументыПоУчетуВремени.Чтение.Организации
	|ЖурналДокументов.ДокументыРасходаДенег.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыРасходаДенег.Чтение.Кассы
	|ЖурналДокументов.ДокументыРасходаДенег.Чтение.Организации
	|ЖурналДокументов.КомиссионнаяТорговля.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.КомиссионнаяТорговля.Чтение.Организации
	|ЖурналДокументов.КомиссионнаяТорговля.Чтение.СтруктурныеЕдиницы
	|ЖурналДокументов.РозничныеПродажи.Чтение.Организации
	|ЖурналДокументов.СкладскиеАкты.Чтение.Организации
	|ЖурналДокументов.СкладскиеАкты.Чтение.СтруктурныеЕдиницы
	|ЖурналДокументов.СкладскиеОрдера.Чтение.Организации
	|ЖурналДокументов.СкладскиеОрдера.Чтение.СтруктурныеЕдиницы
	|ЖурналДокументов.ЧекиККМ.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ЧекиККМ.Чтение.Организации
	|ЖурналДокументов.ЧекиККМ.Чтение.СтруктурныеЕдиницы
	|";
	#КонецВставки    
	
	Возврат Результат;

КонецФункции

&ИзменениеИКонтроль("ВидыОграниченийПравРегистров")
Функция Пр_ВидыОграниченийПравРегистров()
	
	#Удаление
	Результат =
	"РегистрБухгалтерии.Управленческий.Чтение.Организации
	|РегистрНакопления.ВыпускПродукции.Чтение.Организации
	|РегистрНакопления.ГрафикДвиженияЗапасов.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ГрафикДвиженияЗапасов.Чтение.Организации
	|РегистрНакопления.ДенежныеСредства.Чтение.БанковскиеСчета
	|РегистрНакопления.ДенежныеСредства.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредства.Чтение.КассыККМ
	|РегистрНакопления.ДенежныеСредства.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваВКассахККМ.Чтение.КассыККМ
	|РегистрНакопления.ДенежныеСредстваВКассахККМ.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваВРезерве.Чтение.БанковскиеСчета
	|РегистрНакопления.ДенежныеСредстваВРезерве.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредстваВРезерве.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваКПоступлению.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредстваКПоступлению.Чтение.КассыККМ
	|РегистрНакопления.ДенежныеСредстваКПоступлению.Чтение.Организации
	|РегистрНакопления.УдалитьДенежныеСредстваПрогноз.Чтение.Организации
	|РегистрНакопления.ДвиженияДенежныхСредств.Чтение.Организации
	|РегистрНакопления.ДоходыИРасходы.Чтение.Организации
	|РегистрНакопления.ДоходыИРасходыОтложенные.Чтение.Организации
	|РегистрНакопления.ДоходыИРасходыПрогноз.Чтение.Организации
	|РегистрНакопления.ЗаданияНаРаботу.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ЗаданияНаРаботу.Чтение.Организации
	|РегистрНакопления.ЗаказыНаПроизводство.Чтение.Организации
	|РегистрНакопления.ЗаказыНаПеремещение.Чтение.Организации
	|РегистрНакопления.ЗаказыПокупателей.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ЗаказыПокупателей.Чтение.Организации
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.Организации
	|РегистрНакопления.Закупки.Чтение.Организации
	|РегистрНакопления.ЗакупкиДляКУДиР.Чтение.Организации
	|РегистрНакопления.Запасы.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.Запасы.Чтение.Организации
	|РегистрНакопления.Запасы.Чтение.Склады
	|РегистрНакопления.ЗапасыВРазрезеГТД.Чтение.Организации
	|РегистрНакопления.ЗапасыВРемонте.Чтение.Организации
	|РегистрНакопления.ЗапасыКПоступлениюНаСклады.Чтение.Организации
	|РегистрНакопления.ЗапасыКПоступлениюНаСклады.Чтение.Склады
	|РегистрНакопления.ЗапасыКРасходуСоСкладов.Чтение.Организации
	|РегистрНакопления.ЗапасыКРасходуСоСкладов.Чтение.Склады
	|РегистрНакопления.ЗапасыНаСкладах.Чтение.Организации
	|РегистрНакопления.ЗапасыНаСкладах.Чтение.Склады
	|РегистрНакопления.ЗапасыПереданные.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ЗапасыПереданные.Чтение.Организации
	|РегистрНакопления.ЗапасыПереданныеВРазрезеГТД.Чтение.Организации
	|РегистрНакопления.ЗапасыПереданныеВРемонте.Чтение.Организации
	|РегистрНакопления.ЗапасыПринятыеВРазрезеГТД.Чтение.Организации
	|РегистрНакопления.ЗапасыИАгентскиеУслугиПринятые.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ЗапасыИАгентскиеУслугиПринятые.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходов.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовПатент.Чтение.Организации
	|РегистрНакопления.НачисленияИУдержания.Чтение.Организации
	|РегистрНакопления.НДФЛДоходы.Чтение.Организации
	|РегистрНакопления.НДФЛРасчетыНалоговыхАгентовСБюджетом.Чтение.Организации
	|РегистрНакопления.ОплатаДокументов.Чтение.Организации
	|РегистрНакопления.ОплатаПлатежнымиКартами.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ОплатаПлатежнымиКартами.Чтение.Организации
	|РегистрНакопления.ОплатаПлатежнымиКартами.Чтение.Склады
	|РегистрНакопления.ОплатаПлатежнымиКартами.Чтение.КассыККМ
	|РегистрНакопления.ОплатаСчетовИЗаказов.Чтение.Организации
	|РегистрНакопления.ПартииТоваров.Чтение.Организации
	|РегистрНакопления.ПланыПродаж.Чтение.Организации
	|РегистрНакопления.ПлатежныйКалендарь.Чтение.БанковскиеСчета
	|РегистрНакопления.ПлатежныйКалендарь.Чтение.Кассы
	|РегистрНакопления.ПлатежныйКалендарь.Чтение.КассыККМ
	|РегистрНакопления.ПлатежныйКалендарь.Чтение.Организации
	|РегистрНакопления.ПотребностьВЗапасах.Чтение.Организации
	|РегистрНакопления.ПредоставленныеСкидки.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ПримененныеВычетыПоНДФЛ.Чтение.Организации
	|РегистрНакопления.Продажи.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.Продажи.Чтение.Организации
	|РегистрНакопления.ПродажиПоДисконтнымКартам.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.РазмещениеЗаказов.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.РазмещениеЗаказов.Чтение.Организации
	|РегистрНакопления.РасчетыПоКредитамИЗаймам.Чтение.ВидыДоговоровКредитаИЗайма
	|РегистрНакопления.РасчетыПоКредитамИЗаймам.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.РасчетыПоКредитамИЗаймам.Чтение.Организации
	|РегистрНакопления.РасчетыПоНалогам.Чтение.Организации
	|РегистрНакопления.РезервыТоваровОрганизаций.Чтение.Организации
	|РегистрНакопления.РезервыТоваровОрганизаций.Чтение.Склады
	|РегистрНакопления.РасчетыПоЭквайрингу.Чтение.Кассы
	|РегистрНакопления.РасчетыПоЭквайрингу.Чтение.Организации
	|РегистрНакопления.РасчетыСПерсоналом.Чтение.Организации
	|РегистрНакопления.РасчетыСПодотчетниками.Чтение.Организации
	|РегистрНакопления.РасчетыСПокупателями.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.РасчетыСПокупателями.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщиками.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.РасчетыСПоставщиками.Чтение.Организации
	|РегистрНакопления.РасчетыСПрочимиКонтрагентами.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.РасчетыСПрочимиКонтрагентами.Чтение.Организации
	|РегистрНакопления.РасчетыСФондамиПоСтраховымВзносамУНФ.Чтение.Организации
	|РегистрНакопления.СдельныеНаряды.Чтение.Организации
	|РегистрНакопления.СерииНоменклатуры.Чтение.Организации
	|РегистрНакопления.СерииНоменклатуры.Чтение.Склады
	|РегистрНакопления.СерииНоменклатурыКПоступлению.Чтение.Организации
	|РегистрНакопления.СерииНоменклатурыКПоступлению.Чтение.Склады
	|РегистрНакопления.СерииНоменклатурыКРасходу.Чтение.Организации
	|РегистрНакопления.СерииНоменклатурыКРасходу.Чтение.Склады
	|РегистрНакопления.СтраховыеВзносыДоходы.Чтение.Организации
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Чтение.Организации
	|РегистрНакопления.СуммовойУчетВРознице.Чтение.Организации
	|РегистрНакопления.СуммовойУчетВРознице.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.СуммовойУчетВРознице.Чтение.Склады
	|РегистрНакопления.Табель.Чтение.Организации
	|РегистрНакопления.ФинансовыйРезультат.Чтение.Организации
	|РегистрСведений.АрхивДанныхРегламентированнойОтчетности.Чтение.Организации
	|РегистрСведений.ВложенияНеформализованныхДокументов.Изменение.Организации
	|РегистрСведений.ВложенияНеформализованныхДокументов.Чтение.Организации
	|РегистрСведений.ДокументыПоТребованиюФНС.Изменение.Организации
	|РегистрСведений.ДокументыПоТребованиюФНС.Чтение.Организации
	|РегистрСведений.ДополнительныеСведения.Изменение.ДополнительныеСведения
	|РегистрСведений.ДополнительныеСведения.Чтение.ДополнительныеСведения
	|РегистрСведений.ЖурналНовыхСобытий.Чтение.Организации
	|РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы.Изменение.Организации
	|РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы.Чтение.Организации
	|РегистрСведений.ЖурналОтчетовСтатусы.Изменение.Организации
	|РегистрСведений.ЖурналОтчетовСтатусы.Чтение.Организации
	|РегистрСведений.НастройкиИнтеграцииСоСпринтером.Изменение.Организации
	|РегистрСведений.НастройкиИнтеграцииСоСпринтером.Чтение.Организации
	|РегистрСведений.НастройкиОбменаРПН.Изменение.Организации
	|РегистрСведений.НастройкиОбменаРПН.Чтение.Организации
	|РегистрСведений.НастройкиОбменаСУЗ.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФСРАР.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФСРАР.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФСС.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФСС.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФТС.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФТС.Чтение.Организации
	|РегистрСведений.НумераторПачекПФР.Изменение.Организации
	|РегистрСведений.НумераторПачекПФР.Чтение.Организации
	|РегистрСведений.ОстаткиВзаиморасчетов.Чтение.ГруппыКонтрагентов
	|РегистрСведений.ОстаткиТоваров.Чтение.Организации
	|РегистрСведений.ОстаткиТоваров.Чтение.Склады
	|РегистрСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОН.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОН.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОС.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОС.Чтение.Организации
	|РегистрСведений.ОчередьСообщенийЗЕРНО.Чтение.Организации
	|РегистрСведений.ОчередьСообщенийИСМП.Чтение.Организации
	|РегистрСведений.ПулКодовМаркировкиСУЗ.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЖурнал.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЖурнал.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЛицензии.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЛицензии.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел1.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел1.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел2.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел2.Чтение.Организации
	|РегистрСведений.СобытияКалендаряБухгалтера.Изменение.Организации
	|РегистрСведений.СобытияКалендаряБухгалтера.Чтение.Организации
	|РегистрСведений.СостоянияВыгрузкиНоменклатуры.Изменение.Организации
	|РегистрСведений.СостоянияВыгрузкиНоменклатуры.Чтение.Организации
	|РегистрСведений.СтатусыОтправки.Изменение.Организации
	|РегистрСведений.СтатусыОтправки.Чтение.Организации
	|РегистрСведений.СчетчикиВыгрузок.Изменение.Организации
	|РегистрСведений.СчетчикиВыгрузок.Чтение.Организации
	|РегистрСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов.Чтение.Организации
	|РегистрСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов.Изменение.Организации
	|РегистрСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов.Чтение.Организации
	|РегистрСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов.Изменение.Организации
	|РегистрСведений.ЦеныНоменклатуры.Чтение.ВидыЦен
	|РегистрСведений.ВидыМинимальныхЦенСтруктурныхЕдиниц.Чтение.ВидыЦен
	|РегистрСведений.ЦеныНоменклатурыКонтрагентов.Чтение.ГруппыКонтрагентов
	|";
    #КонецУдаления
	
	#Вставка
	Результат =
	"РегистрБухгалтерии.Управленческий.Чтение.Организации
	|РегистрНакопления.ВыпускПродукции.Чтение.Организации
	|РегистрНакопления.ГрафикДвиженияЗапасов.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ГрафикДвиженияЗапасов.Чтение.Организации
	|РегистрНакопления.ДенежныеСредства.Чтение.БанковскиеСчета
	|РегистрНакопления.ДенежныеСредства.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредства.Чтение.КассыККМ
	|РегистрНакопления.ДенежныеСредства.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваВКассахККМ.Чтение.КассыККМ
	|РегистрНакопления.ДенежныеСредстваВКассахККМ.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваВРезерве.Чтение.БанковскиеСчета
	|РегистрНакопления.ДенежныеСредстваВРезерве.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредстваВРезерве.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваКПоступлению.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредстваКПоступлению.Чтение.КассыККМ
	|РегистрНакопления.ДенежныеСредстваКПоступлению.Чтение.Организации
	|РегистрНакопления.УдалитьДенежныеСредстваПрогноз.Чтение.Организации
	|РегистрНакопления.ДвиженияДенежныхСредств.Чтение.Организации
	|РегистрНакопления.ДоходыИРасходы.Чтение.Организации
	|РегистрНакопления.ДоходыИРасходыОтложенные.Чтение.Организации
	|РегистрНакопления.ДоходыИРасходыПрогноз.Чтение.Организации
	|РегистрНакопления.ЗаданияНаРаботу.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ЗаданияНаРаботу.Чтение.Организации
	|РегистрНакопления.ЗаказыНаПроизводство.Чтение.Организации
	|РегистрНакопления.ЗаказыНаПеремещение.Чтение.Организации
	|РегистрНакопления.ЗаказыПокупателей.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ЗаказыПокупателей.Чтение.Организации
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.Организации
	|РегистрНакопления.Закупки.Чтение.Организации
	|РегистрНакопления.ЗакупкиДляКУДиР.Чтение.Организации
	|РегистрНакопления.Запасы.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.Запасы.Чтение.Организации
	|РегистрНакопления.Запасы.Чтение.СтруктурныеЕдиницы
	|РегистрНакопления.ЗапасыВРазрезеГТД.Чтение.Организации
	|РегистрНакопления.ЗапасыВРемонте.Чтение.Организации
	|РегистрНакопления.ЗапасыКПоступлениюНаСклады.Чтение.Организации
	|РегистрНакопления.ЗапасыКПоступлениюНаСклады.Чтение.СтруктурныеЕдиницы
	|РегистрНакопления.ЗапасыКРасходуСоСкладов.Чтение.Организации
	|РегистрНакопления.ЗапасыКРасходуСоСкладов.Чтение.СтруктурныеЕдиницы
	|РегистрНакопления.ЗапасыНаСкладах.Чтение.Организации
	|РегистрНакопления.ЗапасыНаСкладах.Чтение.СтруктурныеЕдиницы
	|РегистрНакопления.ЗапасыПереданные.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ЗапасыПереданные.Чтение.Организации
	|РегистрНакопления.ЗапасыПереданныеВРазрезеГТД.Чтение.Организации
	|РегистрНакопления.ЗапасыПереданныеВРемонте.Чтение.Организации
	|РегистрНакопления.ЗапасыПринятыеВРазрезеГТД.Чтение.Организации
	|РегистрНакопления.ЗапасыИАгентскиеУслугиПринятые.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ЗапасыИАгентскиеУслугиПринятые.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходов.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовПатент.Чтение.Организации
	|РегистрНакопления.НачисленияИУдержания.Чтение.Организации
	|РегистрНакопления.НДФЛДоходы.Чтение.Организации
	|РегистрНакопления.НДФЛРасчетыНалоговыхАгентовСБюджетом.Чтение.Организации
	|РегистрНакопления.ОплатаДокументов.Чтение.Организации
	|РегистрНакопления.ОплатаПлатежнымиКартами.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ОплатаПлатежнымиКартами.Чтение.Организации
	|РегистрНакопления.ОплатаПлатежнымиКартами.Чтение.СтруктурныеЕдиницы
	|РегистрНакопления.ОплатаПлатежнымиКартами.Чтение.КассыККМ
	|РегистрНакопления.ОплатаСчетовИЗаказов.Чтение.Организации
	|РегистрНакопления.ПартииТоваров.Чтение.Организации
	|РегистрНакопления.ПланыПродаж.Чтение.Организации
	|РегистрНакопления.ПлатежныйКалендарь.Чтение.БанковскиеСчета
	|РегистрНакопления.ПлатежныйКалендарь.Чтение.Кассы
	|РегистрНакопления.ПлатежныйКалендарь.Чтение.КассыККМ
	|РегистрНакопления.ПлатежныйКалендарь.Чтение.Организации
	|РегистрНакопления.ПотребностьВЗапасах.Чтение.Организации
	|РегистрНакопления.ПредоставленныеСкидки.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ПримененныеВычетыПоНДФЛ.Чтение.Организации
	|РегистрНакопления.Продажи.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.Продажи.Чтение.Организации
	|РегистрНакопления.ПродажиПоДисконтнымКартам.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.РазмещениеЗаказов.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.РазмещениеЗаказов.Чтение.Организации
	|РегистрНакопления.РасчетыПоКредитамИЗаймам.Чтение.ВидыДоговоровКредитаИЗайма
	|РегистрНакопления.РасчетыПоКредитамИЗаймам.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.РасчетыПоКредитамИЗаймам.Чтение.Организации
	|РегистрНакопления.РасчетыПоНалогам.Чтение.Организации
	|РегистрНакопления.РезервыТоваровОрганизаций.Чтение.Организации
	|РегистрНакопления.РезервыТоваровОрганизаций.Чтение.СтруктурныеЕдиницы
	|РегистрНакопления.РасчетыПоЭквайрингу.Чтение.Кассы
	|РегистрНакопления.РасчетыПоЭквайрингу.Чтение.Организации
	|РегистрНакопления.РасчетыСПерсоналом.Чтение.Организации
	|РегистрНакопления.РасчетыСПодотчетниками.Чтение.Организации
	|РегистрНакопления.РасчетыСПокупателями.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.РасчетыСПокупателями.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщиками.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.РасчетыСПоставщиками.Чтение.Организации
	|РегистрНакопления.РасчетыСПрочимиКонтрагентами.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.РасчетыСПрочимиКонтрагентами.Чтение.Организации
	|РегистрНакопления.РасчетыСФондамиПоСтраховымВзносамУНФ.Чтение.Организации
	|РегистрНакопления.СдельныеНаряды.Чтение.Организации
	|РегистрНакопления.СерииНоменклатуры.Чтение.Организации
	|РегистрНакопления.СерииНоменклатуры.Чтение.СтруктурныеЕдиницы
	|РегистрНакопления.СерииНоменклатурыКПоступлению.Чтение.Организации
	|РегистрНакопления.СерииНоменклатурыКПоступлению.Чтение.СтруктурныеЕдиницы
	|РегистрНакопления.СерииНоменклатурыКРасходу.Чтение.Организации
	|РегистрНакопления.СерииНоменклатурыКРасходу.Чтение.СтруктурныеЕдиницы
	|РегистрНакопления.СтраховыеВзносыДоходы.Чтение.Организации
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Чтение.Организации
	|РегистрНакопления.СуммовойУчетВРознице.Чтение.Организации
	|РегистрНакопления.СуммовойУчетВРознице.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.СуммовойУчетВРознице.Чтение.СтруктурныеЕдиницы
	|РегистрНакопления.Табель.Чтение.Организации
	|РегистрНакопления.ФинансовыйРезультат.Чтение.Организации
	|РегистрСведений.АрхивДанныхРегламентированнойОтчетности.Чтение.Организации
	|РегистрСведений.ВложенияНеформализованныхДокументов.Изменение.Организации
	|РегистрСведений.ВложенияНеформализованныхДокументов.Чтение.Организации
	|РегистрСведений.ДокументыПоТребованиюФНС.Изменение.Организации
	|РегистрСведений.ДокументыПоТребованиюФНС.Чтение.Организации
	|РегистрСведений.ДополнительныеСведения.Изменение.ДополнительныеСведения
	|РегистрСведений.ДополнительныеСведения.Чтение.ДополнительныеСведения
	|РегистрСведений.ЖурналНовыхСобытий.Чтение.Организации
	|РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы.Изменение.Организации
	|РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы.Чтение.Организации
	|РегистрСведений.ЖурналОтчетовСтатусы.Изменение.Организации
	|РегистрСведений.ЖурналОтчетовСтатусы.Чтение.Организации
	|РегистрСведений.НастройкиИнтеграцииСоСпринтером.Изменение.Организации
	|РегистрСведений.НастройкиИнтеграцииСоСпринтером.Чтение.Организации
	|РегистрСведений.НастройкиОбменаРПН.Изменение.Организации
	|РегистрСведений.НастройкиОбменаРПН.Чтение.Организации
	|РегистрСведений.НастройкиОбменаСУЗ.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФСРАР.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФСРАР.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФСС.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФСС.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФТС.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФТС.Чтение.Организации
	|РегистрСведений.НумераторПачекПФР.Изменение.Организации
	|РегистрСведений.НумераторПачекПФР.Чтение.Организации
	|РегистрСведений.ОстаткиВзаиморасчетов.Чтение.ГруппыКонтрагентов
	|РегистрСведений.ОстаткиТоваров.Чтение.Организации
	|РегистрСведений.ОстаткиТоваров.Чтение.СтруктурныеЕдиницы
	|РегистрСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОН.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОН.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОС.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОС.Чтение.Организации
	|РегистрСведений.ОчередьСообщенийЗЕРНО.Чтение.Организации
	|РегистрСведений.ОчередьСообщенийИСМП.Чтение.Организации
	|РегистрСведений.ПулКодовМаркировкиСУЗ.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЖурнал.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЖурнал.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЛицензии.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЛицензии.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел1.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел1.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел2.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел2.Чтение.Организации
	|РегистрСведений.СобытияКалендаряБухгалтера.Изменение.Организации
	|РегистрСведений.СобытияКалендаряБухгалтера.Чтение.Организации
	|РегистрСведений.СостоянияВыгрузкиНоменклатуры.Изменение.Организации
	|РегистрСведений.СостоянияВыгрузкиНоменклатуры.Чтение.Организации
	|РегистрСведений.СтатусыОтправки.Изменение.Организации
	|РегистрСведений.СтатусыОтправки.Чтение.Организации
	|РегистрСведений.СчетчикиВыгрузок.Изменение.Организации
	|РегистрСведений.СчетчикиВыгрузок.Чтение.Организации
	|РегистрСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов.Чтение.Организации
	|РегистрСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов.Изменение.Организации
	|РегистрСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов.Чтение.Организации
	|РегистрСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов.Изменение.Организации
	|РегистрСведений.ЦеныНоменклатуры.Чтение.ВидыЦен
	|РегистрСведений.ВидыМинимальныхЦенСтруктурныхЕдиниц.Чтение.ВидыЦен
	|РегистрСведений.ЦеныНоменклатурыКонтрагентов.Чтение.ГруппыКонтрагентов
	|";
	#КонецВставки
	
	Возврат Результат;

КонецФункции

&ИзменениеИКонтроль("ВидыОграниченийПравСправочниковИПлановВидовХарактеристик")
Функция Пр_ВидыОграниченийПравСправочниковИПлановВидовХарактеристик()
	
	#Удаление
	Результат =
	"ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Чтение.ДополнительныеСведения
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктОРасхожденияхПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.АктОРасхожденияхПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктОРасхожденияхПрисоединенныеФайлы.Изменение.Склады
	|Справочник.АктОРасхожденияхПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.АктОРасхожденияхПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктОРасхожденияхПрисоединенныеФайлы.Чтение.Склады
	|Справочник.АктОРасхожденияхПолученныйПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.АктОРасхожденияхПолученныйПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктОРасхожденияхПолученныйПрисоединенныеФайлы.Изменение.Склады
	|Справочник.АктОРасхожденияхПолученныйПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.АктОРасхожденияхПолученныйПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктОРасхожденияхПолученныйПрисоединенныеФайлы.Чтение.Склады
	|Справочник.БанковскиеСчета.Изменение.БанковскиеСчета
	|Справочник.БанковскиеСчета.Чтение.БанковскиеСчета
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.АвансовыйОтчет
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ДоговорКредитаИЗайма
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ЗаданиеНаРаботу
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ЗаказПокупателя
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ЗаказПоставщику
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ИнвентаризацияЗапасов
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ПоступлениеНаСчет
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ПриходнаяНакладная
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.РасходИзКассы
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.РасходСоСчета
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.Событие
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.СчетНаОплатуПоставщика
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.СчетФактура
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.СчетФактураПолученный
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ДоговорыКонтрагентов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Контрагенты
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Номенклатура
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Организации
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Спецификации
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.АвансовыйОтчет
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ДоговорКредитаИЗайма
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ЗаданиеНаРаботу
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ЗаказПокупателя
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ЗаказПоставщику
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ИнвентаризацияЗапасов
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ПоступлениеНаСчет
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ПриходнаяНакладная
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.РасходИзКассы
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.РасходСоСчета
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.Событие
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.СчетНаОплатуПоставщика
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.СчетФактура
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.СчетФактураПолученный
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ДоговорыКонтрагентов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Контрагенты
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Номенклатура
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Организации
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Спецификации
	|Справочник.ВидыДеятельностиЕНВД.Изменение.Организации
	|Справочник.ВидыДеятельностиЕНВД.Чтение.Организации
	|Справочник.ВидыЦен.Изменение.ВидыЦен
	|Справочник.ВидыЦен.Чтение.ВидыЦен
	|Справочник.ГруппыДоступаКонтрагентов.Чтение.ГруппыКонтрагентов
	|Справочник.ГруппыДоступаЛидов.Чтение.ГруппыЛидов
	|Справочник.Делегирование.Чтение.Организации
	|Справочник.ДисконтныеКарты.Изменение.ГруппыКонтрагентов
	|Справочник.ДисконтныеКарты.Чтение.ГруппыКонтрагентов
	|Справочник.ДоверенностиНалогоплательщика.Изменение.Организации
	|Справочник.ДоверенностиНалогоплательщика.Чтение.Организации
	|Справочник.ДоговорыКонтрагентов.Изменение.ГруппыКонтрагентов
	|Справочник.ДоговорыКонтрагентов.Изменение.Организации
	|Справочник.ДоговорыКонтрагентов.Чтение.ГруппыКонтрагентов
	|Справочник.ДоговорыКонтрагентов.Чтение.Организации
	|Справочник.ДоговорыХраненияПартийЗЕРНО.Чтение.Организации
	|Справочник.ДоговорыХраненияПартийЗЕРНО.Изменение.Организации
	|Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Изменение.Организации
	|Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Чтение.Организации
	|Справочник.ДополнительныеОтчетыИОбработки.Чтение.ДополнительныеОтчетыИОбработки
	|Справочник.ДополнительныеРасходыПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.ДополнительныеРасходыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДополнительныеРасходыПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ДополнительныеРасходыПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ДополнительныеРасходыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДополнительныеРасходыПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказНаПеремещениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказНаПеремещениеПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаказНаПеремещениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказНаПеремещениеПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказНаПроизводствоПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказПокупателяПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ЗаказПокупателяПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаписиКалендаряПодготовкиОтчетности.Изменение.Организации
	|Справочник.ЗаписиКалендаряПодготовкиОтчетности.Чтение.Организации
	|Справочник.ЗначенияСвойствОбъектов.Чтение.ДополнительныеСведения
	|Справочник.ЗначенияСвойствОбъектовИерархия.Чтение.ДополнительныеСведения
	|Справочник.ИнвентаризацияЗапасовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИнвентаризацияЗапасовПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ИнвентаризацияЗапасовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИнвентаризацияЗапасовПрисоединенныеФайлы.Чтение.Склады
	|Справочник.Кассы.Изменение.Кассы
	|Справочник.Кассы.Чтение.Кассы
	|Справочник.КассыККМ.Чтение.КассыККМ
	|Справочник.КассыККМ.Чтение.Организации
	|Справочник.КлассификаторОрганизацийЕГАИС.Изменение.ГруппыКонтрагентов
	|Справочник.КлассификаторОрганизацийЕГАИС.Изменение.Организации
	|Справочник.КлассификаторОрганизацийЕГАИС.Чтение.ГруппыКонтрагентов
	|Справочник.КлассификаторОрганизацийЕГАИС.Чтение.Организации
	|Справочник.КонтактныеЛица.Изменение.ГруппыКонтрагентов
	|Справочник.КонтактныеЛица.Чтение.ГруппыКонтрагентов
	|Справочник.Контрагенты.Изменение.ГруппыКонтрагентов
	|Справочник.Контрагенты.Чтение.ГруппыКонтрагентов
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Изменение.Склады
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Чтение.Склады
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.Склады
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.Склады
	|Справочник.Лиды.Изменение.ГруппыЛидов
	|Справочник.Лиды.Чтение.ГруппыЛидов
	|Справочник.МакетыПенсионныхДел.Изменение.Организации
	|Справочник.МакетыПенсионныхДел.Чтение.Организации
	|Справочник.МаршрутыПодписания.Чтение.Организации
	|Справочник.МашиночитаемыеДоверенностиОрганизаций.Чтение.Организации
	|Справочник.МашиночитаемыеДоверенностиОрганизаций.Изменение.Организации
	|Справочник.НастройкиОбменСБанками.Чтение.Организации
	|Справочник.НоменклатураПоставщиков.Изменение.ГруппыКонтрагентов
	|Справочник.НоменклатураПоставщиков.Чтение.ГруппыКонтрагентов
	|Справочник.ОписиВходящихДокументовИзНалоговыхОрганов.Изменение.Организации
	|Справочник.ОписиВходящихДокументовИзНалоговыхОрганов.Чтение.Организации
	|Справочник.ОписиИсходящихДокументовВНалоговыеОрганы.Изменение.Организации
	|Справочник.ОписиИсходящихДокументовВНалоговыеОрганы.Чтение.Организации
	|Справочник.Организации.Изменение.Организации
	|Справочник.Организации.Чтение.Организации
	|Справочник.ОрганизацииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОрганизацииПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтправкиРПН.Изменение.Организации
	|Справочник.ОтправкиРПН.Чтение.Организации
	|Справочник.ОтправкиФСРАР.Изменение.Организации
	|Справочник.ОтправкиФСРАР.Чтение.Организации
	|Справочник.ОтправкиФСС.Изменение.Организации
	|Справочник.ОтправкиФСС.Чтение.Организации
	|Справочник.ОтправкиФТС.Изменение.Организации
	|Справочник.ОтправкиФТС.Чтение.Организации
	|Справочник.ПапкиФайлов.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ПапкиФайлов.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ПеремещениеЗапасовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПеремещениеЗапасовПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПеремещениеЗапасовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПеремещениеЗапасовПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПерепискаСКонтролирующимиОрганами.Изменение.Организации
	|Справочник.ПерепискаСКонтролирующимиОрганами.Чтение.Организации
	|Справочник.ПересортицаЗапасовПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.ПересортицаЗапасовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПересортицаЗапасовПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПересортицаЗапасовПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ПересортицаЗапасовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПересортицаЗапасовПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПлатежноеПоручениеПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.ПлатежноеПоручениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПлатежноеПоручениеПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ПлатежноеПоручениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеНаСчетПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.ПоступлениеНаСчетПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеНаСчетПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ПоступлениеНаСчетПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриемИПередачаВРемонтПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.ПриемИПередачаВРемонтПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриемИПередачаВРемонтПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПриемИПередачаВРемонтПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ПриемИПередачаВРемонтПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриемИПередачаВРемонтПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПриходнаяНакладнаяПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.ПриходнаяНакладнаяПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриходнаяНакладнаяПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПриходнаяНакладнаяПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ПриходнаяНакладнаяПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриходнаяНакладнаяПрисоединенныеФайлы.Чтение.Склады
	|Справочник.Проекты.Изменение.ГруппыКонтрагентов
	|Справочник.Проекты.Чтение.ГруппыКонтрагентов
	|Справочник.ПроектыПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ПроектыПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.РасходИзКассыПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.РасходИзКассыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РасходИзКассыПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.РасходИзКассыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РасходнаяНакладнаяПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.РасходнаяНакладнаяПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РасходнаяНакладнаяПрисоединенныеФайлы.Изменение.Склады
	|Справочник.РасходнаяНакладнаяПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.РасходнаяНакладнаяПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РасходнаяНакладнаяПрисоединенныеФайлы.Чтение.Склады
	|Справочник.РасходСоСчетаПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.РасходСоСчетаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РасходСоСчетаПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.РасходСоСчетаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РегистрацииВНалоговомОргане.Изменение.Организации
	|Справочник.РегистрацииВНалоговомОргане.Чтение.Организации
	|Справочник.СборкаЗапасовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СборкаЗапасовПрисоединенныеФайлы.Изменение.Склады
	|Справочник.СборкаЗапасовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СборкаЗапасовПрисоединенныеФайлы.Чтение.Склады
	|Справочник.СканированныеДокументыДляПередачиВЭлектронномВиде.Изменение.Организации
	|Справочник.СканированныеДокументыДляПередачиВЭлектронномВиде.Чтение.Организации
	|Справочник.СчетНаОплатуПоставщикаПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.СчетНаОплатуПоставщикаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетНаОплатуПоставщикаПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.СчетНаОплатуПоставщикаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.СчетФактураПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ТорговыеТочки.Изменение.Организации
	|Справочник.ТорговыеТочки.Изменение.Организации
	|Справочник.ТорговыеТочки.Чтение.Организации
	|Справочник.ТорговыеТочки.Чтение.Организации
	|Справочник.УчетныеЗаписиМаркетплейсов.Чтение.Организации
	|Справочник.УчетныеЗаписиМаркетплейсов.Изменение.Организации
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Изменение.Пользователи
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Изменение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Чтение.Пользователи
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Чтение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.Файлы.Изменение.Объект.Документ.АвансовыйОтчет
	|Справочник.Файлы.Изменение.Объект.Документ.ДоговорКредитаИЗайма
	|Справочник.Файлы.Изменение.Объект.Документ.ЗаданиеНаРаботу
	|Справочник.Файлы.Изменение.Объект.Документ.ЗаказПокупателя
	|Справочник.Файлы.Изменение.Объект.Документ.ЗаказПоставщику
	|Справочник.Файлы.Изменение.Объект.Документ.ИнвентаризацияЗапасов
	|Справочник.Файлы.Изменение.Объект.Документ.ПоступлениеНаСчет
	|Справочник.Файлы.Изменение.Объект.Документ.ПриходнаяНакладная
	|Справочник.Файлы.Изменение.Объект.Документ.РасходИзКассы
	|Справочник.Файлы.Изменение.Объект.Документ.РасходСоСчета
	|Справочник.Файлы.Изменение.Объект.Документ.Событие
	|Справочник.Файлы.Изменение.Объект.Документ.СчетНаОплатуПоставщика
	|Справочник.Файлы.Изменение.Объект.Документ.СчетФактура
	|Справочник.Файлы.Изменение.Объект.Документ.СчетФактураПолученный
	|Справочник.Файлы.Изменение.Объект.Справочник.ДоговорыКонтрагентов
	|Справочник.Файлы.Изменение.Объект.Справочник.Контрагенты
	|Справочник.Файлы.Изменение.Объект.Справочник.Номенклатура
	|Справочник.Файлы.Изменение.Объект.Справочник.Организации
	|Справочник.Файлы.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.Файлы.Изменение.Объект.Справочник.Спецификации
	|Справочник.Файлы.Чтение.Объект.Документ.АвансовыйОтчет
	|Справочник.Файлы.Чтение.Объект.Документ.ДоговорКредитаИЗайма
	|Справочник.Файлы.Чтение.Объект.Документ.ЗаданиеНаРаботу
	|Справочник.Файлы.Чтение.Объект.Документ.ЗаказПокупателя
	|Справочник.Файлы.Чтение.Объект.Документ.ЗаказПоставщику
	|Справочник.Файлы.Чтение.Объект.Документ.ИнвентаризацияЗапасов
	|Справочник.Файлы.Чтение.Объект.Документ.ПоступлениеНаСчет
	|Справочник.Файлы.Чтение.Объект.Документ.ПриходнаяНакладная
	|Справочник.Файлы.Чтение.Объект.Документ.РасходИзКассы
	|Справочник.Файлы.Чтение.Объект.Документ.РасходСоСчета
	|Справочник.Файлы.Чтение.Объект.Документ.Событие
	|Справочник.Файлы.Чтение.Объект.Документ.СчетНаОплатуПоставщика
	|Справочник.Файлы.Чтение.Объект.Документ.СчетФактура
	|Справочник.Файлы.Чтение.Объект.Документ.СчетФактураПолученный
	|Справочник.Файлы.Чтение.Объект.Справочник.ДоговорыКонтрагентов
	|Справочник.Файлы.Чтение.Объект.Справочник.Контрагенты
	|Справочник.Файлы.Чтение.Объект.Справочник.Номенклатура
	|Справочник.Файлы.Чтение.Объект.Справочник.Организации
	|Справочник.Файлы.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.Файлы.Чтение.Объект.Справочник.Спецификации
	|Справочник.ШаблоныСообщений.Изменение.Пользователи
	|Справочник.ШаблоныСообщений.Чтение.Пользователи
	|Справочник.ШаблоныСообщенийПрисоединенныеФайлы.Изменение.Пользователи
	|Справочник.ШаблоныСообщенийПрисоединенныеФайлы.Чтение.Пользователи
	|Справочник.СпособыОплаты.Изменение.БанковскиеСчета
	|Справочник.СпособыОплаты.Изменение.БанковскиеСчета
	|Справочник.СпособыОплаты.Изменение.Кассы
	|Справочник.СпособыОплаты.Изменение.Кассы
	|Справочник.СпособыОплаты.Изменение.КассыККМ
	|Справочник.СпособыОплаты.Изменение.КассыККМ
	|Справочник.СпособыОплаты.Изменение.Организации
	|Справочник.СпособыОплаты.Изменение.Организации
	|Справочник.СпособыОплаты.Чтение.БанковскиеСчета
	|Справочник.СпособыОплаты.Чтение.Кассы
	|Справочник.СпособыОплаты.Чтение.КассыККМ
	|Справочник.СпособыОплаты.Чтение.Организации
	|Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов.Изменение.Организации
	|Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов.Чтение.Организации
	|Справочник.ПеремещениеДСПланПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ПеремещениеДСПланПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПеремещениеДСПланПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.ПеремещениеДСПланПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеВКассуПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ПоступлениеВКассуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеВКассуПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.ПоступлениеВКассуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеДСПланПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ПоступлениеДСПланПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеДСПланПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.ПоступлениеДСПланПрисоединенныеФайлы.Изменение.Организации
	|";
    #КонецУдаления
	
	#Вставка
	Результат =
	"ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Чтение.ДополнительныеСведения
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктОРасхожденияхПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.АктОРасхожденияхПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктОРасхожденияхПрисоединенныеФайлы.Изменение.СтруктурныеЕдиницы
	|Справочник.АктОРасхожденияхПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.АктОРасхожденияхПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктОРасхожденияхПрисоединенныеФайлы.Чтение.СтруктурныеЕдиницы
	|Справочник.АктОРасхожденияхПолученныйПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.АктОРасхожденияхПолученныйПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктОРасхожденияхПолученныйПрисоединенныеФайлы.Изменение.СтруктурныеЕдиницы
	|Справочник.АктОРасхожденияхПолученныйПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.АктОРасхожденияхПолученныйПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктОРасхожденияхПолученныйПрисоединенныеФайлы.Чтение.СтруктурныеЕдиницы
	|Справочник.БанковскиеСчета.Изменение.БанковскиеСчета
	|Справочник.БанковскиеСчета.Чтение.БанковскиеСчета
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.АвансовыйОтчет
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ДоговорКредитаИЗайма
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ЗаданиеНаРаботу
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ЗаказПокупателя
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ЗаказПоставщику
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ИнвентаризацияЗапасов
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ПоступлениеНаСчет
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ПриходнаяНакладная
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.РасходИзКассы
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.РасходСоСчета
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.Событие
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.СчетНаОплатуПоставщика
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.СчетФактура
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.СчетФактураПолученный
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ДоговорыКонтрагентов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Контрагенты
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Номенклатура
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Организации
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Спецификации
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.АвансовыйОтчет
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ДоговорКредитаИЗайма
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ЗаданиеНаРаботу
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ЗаказПокупателя
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ЗаказПоставщику
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ИнвентаризацияЗапасов
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ПоступлениеНаСчет
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ПриходнаяНакладная
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.РасходИзКассы
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.РасходСоСчета
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.Событие
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.СчетНаОплатуПоставщика
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.СчетФактура
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.СчетФактураПолученный
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ДоговорыКонтрагентов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Контрагенты
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Номенклатура
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Организации
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Спецификации
	|Справочник.ВидыДеятельностиЕНВД.Изменение.Организации
	|Справочник.ВидыДеятельностиЕНВД.Чтение.Организации
	|Справочник.ВидыЦен.Изменение.ВидыЦен
	|Справочник.ВидыЦен.Чтение.ВидыЦен
	|Справочник.ГруппыДоступаКонтрагентов.Чтение.ГруппыКонтрагентов
	|Справочник.ГруппыДоступаЛидов.Чтение.ГруппыЛидов
	|Справочник.Делегирование.Чтение.Организации
	|Справочник.ДисконтныеКарты.Изменение.ГруппыКонтрагентов
	|Справочник.ДисконтныеКарты.Чтение.ГруппыКонтрагентов
	|Справочник.ДоверенностиНалогоплательщика.Изменение.Организации
	|Справочник.ДоверенностиНалогоплательщика.Чтение.Организации
	|Справочник.ДоговорыКонтрагентов.Изменение.ГруппыКонтрагентов
	|Справочник.ДоговорыКонтрагентов.Изменение.Организации
	|Справочник.ДоговорыКонтрагентов.Чтение.ГруппыКонтрагентов
	|Справочник.ДоговорыКонтрагентов.Чтение.Организации
	|Справочник.ДоговорыХраненияПартийЗЕРНО.Чтение.Организации
	|Справочник.ДоговорыХраненияПартийЗЕРНО.Изменение.Организации
	|Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Изменение.Организации
	|Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Чтение.Организации
	|Справочник.ДополнительныеОтчетыИОбработки.Чтение.ДополнительныеОтчетыИОбработки
	|Справочник.ДополнительныеРасходыПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.ДополнительныеРасходыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДополнительныеРасходыПрисоединенныеФайлы.Изменение.СтруктурныеЕдиницы
	|Справочник.ДополнительныеРасходыПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ДополнительныеРасходыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДополнительныеРасходыПрисоединенныеФайлы.Чтение.СтруктурныеЕдиницы
	|Справочник.ЗаказНаПеремещениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказНаПеремещениеПрисоединенныеФайлы.Изменение.СтруктурныеЕдиницы
	|Справочник.ЗаказНаПеремещениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказНаПеремещениеПрисоединенныеФайлы.Чтение.СтруктурныеЕдиницы
	|Справочник.ЗаказНаПроизводствоПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказПокупателяПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ЗаказПокупателяПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаписиКалендаряПодготовкиОтчетности.Изменение.Организации
	|Справочник.ЗаписиКалендаряПодготовкиОтчетности.Чтение.Организации
	|Справочник.ЗначенияСвойствОбъектов.Чтение.ДополнительныеСведения
	|Справочник.ЗначенияСвойствОбъектовИерархия.Чтение.ДополнительныеСведения
	|Справочник.ИнвентаризацияЗапасовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИнвентаризацияЗапасовПрисоединенныеФайлы.Изменение.СтруктурныеЕдиницы
	|Справочник.ИнвентаризацияЗапасовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИнвентаризацияЗапасовПрисоединенныеФайлы.Чтение.СтруктурныеЕдиницы
	|Справочник.Кассы.Изменение.Кассы
	|Справочник.Кассы.Чтение.Кассы
	|Справочник.КассыККМ.Чтение.КассыККМ
	|Справочник.КассыККМ.Чтение.Организации
	|Справочник.КлассификаторОрганизацийЕГАИС.Изменение.ГруппыКонтрагентов
	|Справочник.КлассификаторОрганизацийЕГАИС.Изменение.Организации
	|Справочник.КлассификаторОрганизацийЕГАИС.Чтение.ГруппыКонтрагентов
	|Справочник.КлассификаторОрганизацийЕГАИС.Чтение.Организации
	|Справочник.КонтактныеЛица.Изменение.ГруппыКонтрагентов
	|Справочник.КонтактныеЛица.Чтение.ГруппыКонтрагентов
	|Справочник.Контрагенты.Изменение.ГруппыКонтрагентов
	|Справочник.Контрагенты.Чтение.ГруппыКонтрагентов
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Изменение.СтруктурныеЕдиницы
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Чтение.СтруктурныеЕдиницы
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.СтруктурныеЕдиницы
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.СтруктурныеЕдиницы
	|Справочник.Лиды.Изменение.ГруппыЛидов
	|Справочник.Лиды.Чтение.ГруппыЛидов
	|Справочник.МакетыПенсионныхДел.Изменение.Организации
	|Справочник.МакетыПенсионныхДел.Чтение.Организации
	|Справочник.МаршрутыПодписания.Чтение.Организации
	|Справочник.МашиночитаемыеДоверенностиОрганизаций.Чтение.Организации
	|Справочник.МашиночитаемыеДоверенностиОрганизаций.Изменение.Организации
	|Справочник.НастройкиОбменСБанками.Чтение.Организации
	|Справочник.НоменклатураПоставщиков.Изменение.ГруппыКонтрагентов
	|Справочник.НоменклатураПоставщиков.Чтение.ГруппыКонтрагентов
	|Справочник.ОписиВходящихДокументовИзНалоговыхОрганов.Изменение.Организации
	|Справочник.ОписиВходящихДокументовИзНалоговыхОрганов.Чтение.Организации
	|Справочник.ОписиИсходящихДокументовВНалоговыеОрганы.Изменение.Организации
	|Справочник.ОписиИсходящихДокументовВНалоговыеОрганы.Чтение.Организации
	|Справочник.Организации.Изменение.Организации
	|Справочник.Организации.Чтение.Организации
	|Справочник.ОрганизацииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОрганизацииПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтправкиРПН.Изменение.Организации
	|Справочник.ОтправкиРПН.Чтение.Организации
	|Справочник.ОтправкиФСРАР.Изменение.Организации
	|Справочник.ОтправкиФСРАР.Чтение.Организации
	|Справочник.ОтправкиФСС.Изменение.Организации
	|Справочник.ОтправкиФСС.Чтение.Организации
	|Справочник.ОтправкиФТС.Изменение.Организации
	|Справочник.ОтправкиФТС.Чтение.Организации
	|Справочник.ПапкиФайлов.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ПапкиФайлов.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ПеремещениеЗапасовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПеремещениеЗапасовПрисоединенныеФайлы.Изменение.СтруктурныеЕдиницы
	|Справочник.ПеремещениеЗапасовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПеремещениеЗапасовПрисоединенныеФайлы.Чтение.СтруктурныеЕдиницы
	|Справочник.ПерепискаСКонтролирующимиОрганами.Изменение.Организации
	|Справочник.ПерепискаСКонтролирующимиОрганами.Чтение.Организации
	|Справочник.ПересортицаЗапасовПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.ПересортицаЗапасовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПересортицаЗапасовПрисоединенныеФайлы.Изменение.СтруктурныеЕдиницы
	|Справочник.ПересортицаЗапасовПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ПересортицаЗапасовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПересортицаЗапасовПрисоединенныеФайлы.Чтение.СтруктурныеЕдиницы
	|Справочник.ПлатежноеПоручениеПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.ПлатежноеПоручениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПлатежноеПоручениеПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ПлатежноеПоручениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеНаСчетПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.ПоступлениеНаСчетПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеНаСчетПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ПоступлениеНаСчетПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриемИПередачаВРемонтПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.ПриемИПередачаВРемонтПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриемИПередачаВРемонтПрисоединенныеФайлы.Изменение.СтруктурныеЕдиницы
	|Справочник.ПриемИПередачаВРемонтПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ПриемИПередачаВРемонтПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриемИПередачаВРемонтПрисоединенныеФайлы.Чтение.СтруктурныеЕдиницы
	|Справочник.ПриходнаяНакладнаяПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.ПриходнаяНакладнаяПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриходнаяНакладнаяПрисоединенныеФайлы.Изменение.СтруктурныеЕдиницы
	|Справочник.ПриходнаяНакладнаяПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ПриходнаяНакладнаяПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриходнаяНакладнаяПрисоединенныеФайлы.Чтение.СтруктурныеЕдиницы
	|Справочник.Проекты.Изменение.ГруппыКонтрагентов
	|Справочник.Проекты.Чтение.ГруппыКонтрагентов
	|Справочник.ПроектыПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ПроектыПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.РасходИзКассыПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.РасходИзКассыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РасходИзКассыПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.РасходИзКассыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РасходнаяНакладнаяПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.РасходнаяНакладнаяПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РасходнаяНакладнаяПрисоединенныеФайлы.Изменение.СтруктурныеЕдиницы
	|Справочник.РасходнаяНакладнаяПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.РасходнаяНакладнаяПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РасходнаяНакладнаяПрисоединенныеФайлы.Чтение.СтруктурныеЕдиницы
	|Справочник.РасходСоСчетаПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.РасходСоСчетаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РасходСоСчетаПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.РасходСоСчетаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РегистрацииВНалоговомОргане.Изменение.Организации
	|Справочник.РегистрацииВНалоговомОргане.Чтение.Организации
	|Справочник.СборкаЗапасовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СборкаЗапасовПрисоединенныеФайлы.Изменение.СтруктурныеЕдиницы
	|Справочник.СборкаЗапасовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СборкаЗапасовПрисоединенныеФайлы.Чтение.СтруктурныеЕдиницы
	|Справочник.СканированныеДокументыДляПередачиВЭлектронномВиде.Изменение.Организации
	|Справочник.СканированныеДокументыДляПередачиВЭлектронномВиде.Чтение.Организации
	|Справочник.СчетНаОплатуПоставщикаПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.СчетНаОплатуПоставщикаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетНаОплатуПоставщикаПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.СчетНаОплатуПоставщикаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.СчетФактураПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ТорговыеТочки.Изменение.Организации
	|Справочник.ТорговыеТочки.Изменение.Организации
	|Справочник.ТорговыеТочки.Чтение.Организации
	|Справочник.ТорговыеТочки.Чтение.Организации
	|Справочник.УчетныеЗаписиМаркетплейсов.Чтение.Организации
	|Справочник.УчетныеЗаписиМаркетплейсов.Изменение.Организации
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Изменение.Пользователи
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Изменение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Чтение.Пользователи
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Чтение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.Файлы.Изменение.Объект.Документ.АвансовыйОтчет
	|Справочник.Файлы.Изменение.Объект.Документ.ДоговорКредитаИЗайма
	|Справочник.Файлы.Изменение.Объект.Документ.ЗаданиеНаРаботу
	|Справочник.Файлы.Изменение.Объект.Документ.ЗаказПокупателя
	|Справочник.Файлы.Изменение.Объект.Документ.ЗаказПоставщику
	|Справочник.Файлы.Изменение.Объект.Документ.ИнвентаризацияЗапасов
	|Справочник.Файлы.Изменение.Объект.Документ.ПоступлениеНаСчет
	|Справочник.Файлы.Изменение.Объект.Документ.ПриходнаяНакладная
	|Справочник.Файлы.Изменение.Объект.Документ.РасходИзКассы
	|Справочник.Файлы.Изменение.Объект.Документ.РасходСоСчета
	|Справочник.Файлы.Изменение.Объект.Документ.Событие
	|Справочник.Файлы.Изменение.Объект.Документ.СчетНаОплатуПоставщика
	|Справочник.Файлы.Изменение.Объект.Документ.СчетФактура
	|Справочник.Файлы.Изменение.Объект.Документ.СчетФактураПолученный
	|Справочник.Файлы.Изменение.Объект.Справочник.ДоговорыКонтрагентов
	|Справочник.Файлы.Изменение.Объект.Справочник.Контрагенты
	|Справочник.Файлы.Изменение.Объект.Справочник.Номенклатура
	|Справочник.Файлы.Изменение.Объект.Справочник.Организации
	|Справочник.Файлы.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.Файлы.Изменение.Объект.Справочник.Спецификации
	|Справочник.Файлы.Чтение.Объект.Документ.АвансовыйОтчет
	|Справочник.Файлы.Чтение.Объект.Документ.ДоговорКредитаИЗайма
	|Справочник.Файлы.Чтение.Объект.Документ.ЗаданиеНаРаботу
	|Справочник.Файлы.Чтение.Объект.Документ.ЗаказПокупателя
	|Справочник.Файлы.Чтение.Объект.Документ.ЗаказПоставщику
	|Справочник.Файлы.Чтение.Объект.Документ.ИнвентаризацияЗапасов
	|Справочник.Файлы.Чтение.Объект.Документ.ПоступлениеНаСчет
	|Справочник.Файлы.Чтение.Объект.Документ.ПриходнаяНакладная
	|Справочник.Файлы.Чтение.Объект.Документ.РасходИзКассы
	|Справочник.Файлы.Чтение.Объект.Документ.РасходСоСчета
	|Справочник.Файлы.Чтение.Объект.Документ.Событие
	|Справочник.Файлы.Чтение.Объект.Документ.СчетНаОплатуПоставщика
	|Справочник.Файлы.Чтение.Объект.Документ.СчетФактура
	|Справочник.Файлы.Чтение.Объект.Документ.СчетФактураПолученный
	|Справочник.Файлы.Чтение.Объект.Справочник.ДоговорыКонтрагентов
	|Справочник.Файлы.Чтение.Объект.Справочник.Контрагенты
	|Справочник.Файлы.Чтение.Объект.Справочник.Номенклатура
	|Справочник.Файлы.Чтение.Объект.Справочник.Организации
	|Справочник.Файлы.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.Файлы.Чтение.Объект.Справочник.Спецификации
	|Справочник.ШаблоныСообщений.Изменение.Пользователи
	|Справочник.ШаблоныСообщений.Чтение.Пользователи
	|Справочник.ШаблоныСообщенийПрисоединенныеФайлы.Изменение.Пользователи
	|Справочник.ШаблоныСообщенийПрисоединенныеФайлы.Чтение.Пользователи
	|Справочник.СпособыОплаты.Изменение.БанковскиеСчета
	|Справочник.СпособыОплаты.Изменение.БанковскиеСчета
	|Справочник.СпособыОплаты.Изменение.Кассы
	|Справочник.СпособыОплаты.Изменение.Кассы
	|Справочник.СпособыОплаты.Изменение.КассыККМ
	|Справочник.СпособыОплаты.Изменение.КассыККМ
	|Справочник.СпособыОплаты.Изменение.Организации
	|Справочник.СпособыОплаты.Изменение.Организации
	|Справочник.СпособыОплаты.Чтение.БанковскиеСчета
	|Справочник.СпособыОплаты.Чтение.Кассы
	|Справочник.СпособыОплаты.Чтение.КассыККМ
	|Справочник.СпособыОплаты.Чтение.Организации
	|Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов.Изменение.Организации
	|Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов.Чтение.Организации
	|Справочник.ПеремещениеДСПланПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ПеремещениеДСПланПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПеремещениеДСПланПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.ПеремещениеДСПланПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеВКассуПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ПоступлениеВКассуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеВКассуПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.ПоступлениеВКассуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеДСПланПрисоединенныеФайлы.Чтение.ГруппыКонтрагентов
	|Справочник.ПоступлениеДСПланПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеДСПланПрисоединенныеФайлы.Изменение.ГруппыКонтрагентов
	|Справочник.ПоступлениеДСПланПрисоединенныеФайлы.Изменение.Организации
	|";
	#КонецВставки
	
	Возврат Результат;

КонецФункции

&ИзменениеИКонтроль("ОбработатьГруппыДоступаПередЗаписью")
Процедура Пр_ОбработатьГруппыДоступаПередЗаписью(Источник, Отказ)
	
	#Вставка
	// Здесь в задании требуется ограничивать по подразделениям, убираем контроль
	Если Истина Тогда
		Возврат;
	КонецЕсли;
	#КонецВставки
	
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;

	Если Источник.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтруктурныеЕдиницы.Наименование КАК НаименованиеПодразделения
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.Ссылка В (&ЗначенияДоступа)
	|	И ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК МагазинГруппаСкладов
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.Ссылка В (&ЗначенияДоступа)
	|	И ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов)";
	Запрос.УстановитьПараметр("ЗначенияДоступа", Источник.ЗначенияДоступа.ВыгрузитьКолонку("ЗначениеДоступа"));
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	Если Не РезультатыЗапроса[0].Пустой() Тогда
		НаименованияПодразделений = РезультатыЗапроса[0].Выгрузить().ВыгрузитьКолонку("НаименованиеПодразделения");
		ПредставленияПодразделений = СтрСоединить(НаименованияПодразделений, ", ");
		ТекстСообщения = СтрШаблон(
		НСтр("ru = 'Ограничение доступа возможно только по складам и магазинам.
		|Исключите следующие подразделения из ограничений: %1'"), ПредставленияПодразделений);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;

	Если Не РезультатыЗапроса[1].Пустой() Тогда
		Выборка = РезультатыЗапроса[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			ОтборСтрок = Новый Структура("ЗначениеДоступа", Выборка.МагазинГруппаСкладов);
			Для Каждого НайденнаяСтрока Из Источник.ЗначенияДоступа.НайтиСтроки(ОтборСтрок) Цикл
				НайденнаяСтрока.ВключаяНижестоящие = Истина;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
