#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =   
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Уровень3Сотрудники
	|	ПО Уровень3Сотрудники.Ссылка = ЭтотСписок.Сотрудник 
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Уровень2Сотрудники  
	|	ПО Уровень2Сотрудники.Ссылка = Уровень3Сотрудники.ГоловнойСотрудник
    |
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Уровень1Сотрудники
	|	ПО Уровень1Сотрудники.Ссылка = Уровень2Сотрудники.ГоловнойСотрудник
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ЭтотСписок.СтруктурнаяЕдиница)
	|	И (ЗначениеРазрешено(Уровень3Сотрудники.Ссылка)
	|   ИЛИ ЗначениеРазрешено(Уровень2Сотрудники.Ссылка)
	|   ИЛИ ЗначениеРазрешено(Уровень1Сотрудники.Ссылка))";

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли