
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию("Разработка по часам");
	СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.НайтиПоНаименованию("Программисты");
	СчетЗатрат = Пр_КорпоративнаяСистемаGitLabВстраиваниеУНФСервер.СчетРасчетаСПрограммистами();
	
	Настройки = КомпоновщикНастроек.Настройки;
	ЭД = Настройки.ПараметрыДанных.Элементы.Найти("Номенклатура");
	ЭД.Значение = ?(ЗначениеЗаполнено(Номенклатура), Номенклатура, Справочники.Номенклатура.ПустаяСсылка());
	ЭД.Использование = Истина;   
	
	Настройки = КомпоновщикНастроек.Настройки;
	ЭД = Настройки.ПараметрыДанных.Элементы.Найти("СтруктурнаяЕдиница");
	ЭД.Значение = ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
	ЭД.Использование = Истина;   

	Настройки = КомпоновщикНастроек.Настройки;
	ЭД = Настройки.ПараметрыДанных.Элементы.Найти("СчетЗатрат");
	ЭД.Значение = ?(ЗначениеЗаполнено(СчетЗатрат), СчетЗатрат, ПланыСчетов.Управленческий.ПустаяСсылка());
	ЭД.Использование = Истина;   
КонецПроцедуры
