#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда
	
#Область ПрограммныйИнтерфейс

// Методы обертки для вызова серверных процедур для асинхронной отправки Issue  
// Из-за наличия регламентного задания и асинхронной отправки на клиенте требуется сделать обертки

// Проверяет статус регистрации документа ЗаданиеНаРаботу
//
// Параметры:
// ЗаданиеНаРаботу - ДокументСсылка.ЗаданиеНаРаботу
//
// Возвращаемое значение:
// Булево
//
Функция СтатусРегистрацииЗаданияНаРаботу(Знач ЗаданиеНаРаботу) Экспорт
	
	Возврат Пр_ОбменGitLabСервер.СтатусРегистрацииЗаданияНаРаботу(ЗаданиеНаРаботу);
	
КонецФункции

// Получает адрес сервера GitLab
//
// Возвращаемое значение:
// Строка
Функция АдресСервераGitLab() Экспорт

	Возврат Пр_ОбменGitLabСервер.АдресСервераGitLab();
	
КонецФункции

// Помещает токен доступа проекта в безопасное хранилище
//
// Параметры:
// ЗаданиеНаРаботу - ДокументСсылка.ЗаданиеНаРаботу
//             
// Возвращаемое значение:
// Строка
//
Функция ТокенДоступаПроектаЗаданияНаРаботу(Знач ЗаданиеНаРаботу) Экспорт

	Возврат Пр_ОбменGitLabСервер.ТокенДоступаПроектаЗаданияНаРаботу(ЗаданиеНаРаботу);

КонецФункции

// Формирует тело запроса issue
//
// Параметры:
// ЗаданиеНаРаботу - ДокументСсылка.ЗаданиеНаРаботу
//
// Возвращаемое значение:
// Строка
//
Функция СформироватьТелоIssue(Знач ЗаданиеНаРаботу) Экспорт
	
	Возврат Пр_ОбменGitLabСервер.СформироватьТелоIssue(ЗаданиеНаРаботу);
	
КонецФункции

// Производит лог ошибок в ЖР
//
// Параметры:
// ИмяСобытия - Строка
// Комментарий - Строка     
// ЗаданиеНаРаботу - ДокументСсылка.ЗаданиеНаРаботу
//
Процедура ЗаписьОшибокОтправки(Знач ИмяСобытия, Знач Комментарий, Знач ЗаданиеНаРаботу = Неопределено) Экспорт

	Пр_ОбменGitLabСервер.ЗаписьОшибокОтправки(ИмяСобытия, Комментарий, ЗаданиеНаРаботу);

КонецПроцедуры

// Получает номер проекта задания на работу
//
// Параметры:
// ЗаданиеНаРаботу - ДокументСсылка.ЗаданиеНаРаботу
//
// Возвращаемое значение:
// Строка
//
Функция НомерПроектаЗаданияНаРаботу(Знач ЗаданиеНаРаботу) Экспорт
	
	Возврат Пр_ОбменGitLabСервер.НомерПроектаЗаданияНаРаботу(ЗаданиеНаРаботу); 

КонецФункции

// Обновляет данные ИБ по данным ответа сервера GitLab
//
// Параметры:  
// ЗаданиеНаРаботу - ДокументСсылка.ЗаданиеНаРаботу
// СтруктураОтвета - Структура
//   
// Возаращаемое значение:
// Булево
//
Функция ОбработатьОтветОтправкиIssue(Знач ЗаданиеНаРаботу, Знач СтруктураОтвета) Экспорт
	
	Возврат Пр_ОбменGitLabСервер.ОбработатьОтветОтправкиIssue(ЗаданиеНаРаботу, СтруктураОтвета);
	
КонецФункции  

// Фиксирует отправку задания на работу
//
// Параметры:
// ЗаданиеНаРаботу - ДокументСсылка.ЗаданиеНаРаботу
//
Процедура ЗафиксироватьОтправкуIssue(Знач ЗаданиеНаРаботу) Экспорт
	
	Пр_ОбменGitLabСервер.ЗафиксироватьОтправкуIssue(ЗаданиеНаРаботу);
	
КонецПроцедуры

// Конец Методы обертки для вызова серверных процедур для асинхронной отправки Issue 

#КонецОбласти

#КонецЕсли                          