#Область ПрограммныйИнтефнйс

// Возвращает пустой уникальный идентфикатор.
//
// Возвращаемое значение:
//  УникальныйИдентификатор - уникальный идентификатор.
//
Функция ПустойУникальныйИдентификатор() Экспорт
	
	Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
КонецФункции

// Проводит обработку перед записью объектов в системе
//
// АдресПроектов - Строка
// ПолноеИмя - Строка
//
Процедура ОбработатьОтвет(Знач АдресПроектов, Знач ПолноеИмя) Экспорт
	
	МенедежрОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
	ОбменМобильноеПриложениеСервер.ЗаписатьДанныеОтвета(АдресПроектов, МенедежрОбъекта);
	
КонецПроцедуры

// Возвращает адрес сервера десктоп приложения
//
// Возвращаемое значение:
// Строка
//
Функция АдресДесктопПриложения() Экспорт
	
	Возврат ОбменМобильноеПриложениеСервер.АдресДесктопПриложения();
	
КонецФункции

#КонецОбласти